import React from "react";

import {
  Heading,
  Subheading,
  Subtitle,
  TopLine,
  UnderlineHeading,
  IndentSubtitle,
  IndentUnderlineHeading,
  Poem,
  CenterSubtitle,
  MiniText,
} from "./InfoElements";

const TextFormat = ({}) => {
  return (
    <>
      <TopLine>Leadership</TopLine>
      <Heading>리더십</Heading>
      <Subtitle>
        리더십이라는 단어는 아주 중요한 의미를 많이 내포하고 있는데 여러분은
        리더십을 들었을 때 무엇을 떠올리고 있나요? 정치 지도자, 직장 상사, 친구,
        가족 중에도 리더가 있다고 생각하나요?
        <br />
        <br />
        훌륭한 지도자가 되기 위해 어떠한 자질을 갖춰야 할지 생각해 보십시오.
        우리는 항상 자신이 갖춘 자질을 알고 싶어하는데 흥미롭게도 이 과정을 통해
        자신이 어떤 리더인지 알 수 있습니다.
        <br />
        <br />
        리더십이란 사람마다 의미하는 바가 다르기 때문에 한마디로 정의하기는
        어렵기 때문에 가장 일반적인 방식으로 어떤 리더십 방식이 있는지 심도 있게
        살펴보겠습니다. 그리고 리더와 관리자의 차이점을 살펴보며, 리더십 능력을
        키우는 방법, 리더십 코칭의 역할을 알아 보도록 하겠습니다.
      </Subtitle>
      <Subheading>리더십이란?</Subheading>
      <Subtitle>
        리더십을 갖춘 사람들은 미래의 비전을 수립할 수 있으며 주변사람들을
        동화시켜 목표를 향해 같이 참여하도록 독려합니다. 리더는 업무의 방향성을
        결정하고 주변 사람들에게 동기를 부여해 활기찬 업무 분위기를 조성할 수
        있습니다.
        <br />
        <br />
        리더와 리더의 자질을 말할 때 보통 직장 안에서의 상황을 쉽게 생각해 볼 수
        있습니다. 강한 리더십을 갖추게 되면 여러분이 자영업을 하던 혹은 큰 조직
        내에 속해 있던 여러분의 업무 능력을 향상시킬 수 있습니다.
        <br />
        <br />
        훌륭한 리더십의 주요 특징들을 보도록 하겠습니다.
        <IndentUnderlineHeading>미래에 대한 목표 수립</IndentUnderlineHeading>
        <IndentSubtitle>
          리더는 미래를 내다보고 회사와 팀의 장기적인 목표를 수립합니다. 자신이
          지향하는 미래의 모습과 그 비전이 어떻게 실현될 지 알고 있습니다. 이
          비전을 통해 회사와 팀에 업무의 방향성을 제시하기도 하고 목표
          달성시점을 알려 주기도 합니다.
          <br />
          <br />
          리더는 미래를 향한 비전을 세우는 것만이 아닌 실현 가능성을 고려해야만
          합니다. 비전을 달성하기 위해서는 문제 해결, 창의성, 새로운 일을 시작할
          수 있는 열정이 필요하기 때문에 리더는 변화를 두려워하지 않고 변화를
          이끌어 나가는 사람이어야 합니다.
        </IndentSubtitle>
        <IndentUnderlineHeading>영감 부여</IndentUnderlineHeading>
        <IndentSubtitle>
          일반적으로 앞으로의 비전을 향해 나아간다는 것은 다른 사람도 이에
          동참하게 한다는 의미가 됩니다.
          <br />
          <br />
          리더들은 사람들이 공동 비전을 공유하도록 독려할 수 있어야 하고 비전을
          창출할 수 있도록 동기 부여할 수 있어야 합니다. 이때에 전문성의 힘이
          절실한 시점입니다. 리더가 해당 분야의 전문가로 인정받게 되면 더 큰
          신뢰를 얻어 사람들이 그를 더 따르고 지지하게 될 것 입니다.
        </IndentSubtitle>
        <IndentUnderlineHeading>코칭과 업무스킬 향상</IndentUnderlineHeading>
        <IndentSubtitle>
          리더는 팀내 구성원들을 잘 서포트 해주며 그들이 업무에 필요한 스킬을
          향상시킬 수 있도록 코칭 해야 합니다. 팀에 기여할 수 있는 진정한 가치를
          가진 팀원을 유지하는 데 도움이 됩니다.
          <br />
          <br />
          리더는 팀이 성장할 수 있도록 그들의 역학관계, 가장 효율적인 업무 방식,
          강점과 약점을 잘 인지할 수 있어야 합니다. 정기적인 교육과 지속적인
          피드백을 제공하여 그들의 성과를 평가할 수 있습니다.
        </IndentSubtitle>
        <IndentUnderlineHeading>비전 실현을 위한 관리</IndentUnderlineHeading>
        <IndentSubtitle>
          이젠 경영 기술에 대해 알아봅시다. 리더는 미래에 대한 비전을 세우는
          것도 중요하지만 이 비전을 실현시킬 수 있어야 합니다. 이것은 사람들이
          기여하도록 이끌어 가는 것만이 아닌 비전을 실현할 수 있는 방법을
          추진해야 함을 뜻합니다. 이는 팀원 스스로 또는 담당책임자가 이끌어갈 수
          있습니다.
          <br />
          <br />
          리더는 계획에 어긋나거나 목표점에 변동이 생기는 것과 같이 불가피한
          경우를 대비하여 일을 처리할 수 있어야 합니다. 그리고 이 상황을
          원활하고 적극적으로 해결하는 것이 리더의 역할이기도 합니다.
        </IndentSubtitle>
      </Subtitle>
      <Subheading>리더십 유형</Subheading>
      <Subtitle>
        리더십을 보여주는 여러 가지 방식을 ‘리더십 유형’이라고 합니다. 다양한
        리더십에 대한 의견이 분분하지만 다음은 일반적으로 접할 수 있는
        유형들입니다.
      </Subtitle>
      <UnderlineHeading>권위주의형 (독재형) 리더십</UnderlineHeading>
      <Subtitle>
        권위주의형 (독재형) 리더십은 리더가 직원에게 가질 수 있는 권한에 중점을
        둡니다. 일반적으로 팀내 낮은 직급을 가진 사람들은 회사에서 필요한
        인재들임에 불구하고 자기 의견을 피력할 수 있는 기회가 거의 없습니다.
        <br />
        <br />
        해당 유형의 리더십은 신속한 결정과 효율적인 업무를 진행할 때
        효과적입니다. 문제점은 그 방식이 팀의 의사와는 다를 수 있고 직원들의
        높은 이직률을 불러올 수 있다는 것입니다.
      </Subtitle>
      <UnderlineHeading>민주형 리더십</UnderlineHeading>
      <Subtitle>
        민주형 리더는 의사 결정 과정에 팀원이 참여할 수 있도록 합니다. 이 유형의
        방식은 동기 부여가 되는 환경을 만들어 팀의 직업적 만족도를 높입니다.
        민주형 리더십은 대부분 좋은 결과를 가져올 수 있지만 의사 결정 과정이
        더디게 진행될 수 있다는 단점도 있습니다. 급박한 상황이나 효율성이 중요한
        경우에는 다른 유형의 리더십이 더 적합할 수도 있습니다.
        <br />
        <br />
        <BigTextLeft>&#x201C;</BigTextLeft>
        <Poem>
          리더는 자신의 신념과 가치에 더불어 당신이 속한 집단이 조화를 이룰 수
          있는 ‘방식’을 찾는 것이 가장 중요합니다.
        </Poem>
        <CenterSubtitle>
          - 라이프 및 경영자 코치 Fabrizio Ricciardi, ‘진정한 리더십’ 중
          <BigTextRight>&#x201D;;</BigTextRight>
        </CenterSubtitle>

        <br />
      </Subtitle>
      <UnderlineHeading>위임형 (자유방임형) 리더십</UnderlineHeading>
      <Subtitle>
        Laissez-faire는 프랑스어로 ‘내버려 두다’라는 의미입니다. 해당 유형의
        리더는 팀이 스스로 일할 수 있도록 맡겨 두고, 팀을 지지하지만 정해진 기한
        없이 시간 활용에 온전한 자유를 부여할 것입니다.
        <br />
        <br />
        팀의 성과를 모니터링하고 주기적인 업무 검토가 이루어 진다면 이 유형의
        리더십이 보다 효과적일 것입니다. 팀원들이 장비와 기술이 부족하고 시간
        관리가 어려운 상황이라면 원치 않는 결과를 가져올 수 있습니다.
      </Subtitle>
      <UnderlineHeading>사람 지향적 리더십</UnderlineHeading>
      <Subtitle>
        사람 또는 관계 지향적 리더의 경우 팀의 발전과 조직을 중요시 합니다. 팀
        내에 모든 팀원들은 동등하게 대우 받으며 동료애도 생겨납니다. 이 유형의
        리더는 팀 원들에게 문제가 없는지 확인하고 필요할 때 언제든지 조언을 건넬
        준비가 되어 있습니다.
        <br />
        <br />이 유형의 단점은 일부 리더가 업무나 프로젝트의 성과보다는 팀의
        성장을 우선 순위로 둘 수도 있게 된다는 것입니다.
      </Subtitle>
      <UnderlineHeading>거래형 리더십</UnderlineHeading>
      <Subtitle>
        이 리더십 유형의 경우는 팀원들이 주어진 포지션을 수락했을 때에 리더에게
        순응하기 시작하며 이에 따라 보상을 받게 되는 방식입니다. 이는 팀원들이
        일정 기준에 부합하지 못할 때는 리더가 ‘징계’를 할 수 있는 방식이라고 볼
        수 있습니다.
        <br />
        <br />
        부정적으로 보일 수 있지만 장점도 있습니다. 이 유형은 투명성이 있기
        때문에 모든 팀원들은 그들 각자에 대한 기대치를 알 수 있습니다. 그리고
        포상 등으로 팀원에게 동기를 부여할 수 있습니다.
      </Subtitle>
      <UnderlineHeading>변혁형 리더십</UnderlineHeading>
      <Subtitle>
        가장 긍정적인 유형으로 꼽히는 변혁형 리더십은 자신과 팀원에게 최고
        성과를 기대하여 이에 부합하도록 이끌어 갑니다. 이와 같은 환경은 일의
        생산성과 참여율을 높입니다. 이 리더십을 통해 팀원들은 프로세스와 사소한
        것들 에게도 주의를 기울이게 되며 이에 리더는 그들로 부터 많은 도움을
        얻을 수 있습니다.
      </Subtitle>
      <Subheading>관리자와 리더의 차이점</Subheading>
      <Subtitle>
        비즈니스 세계에서 ‘리더’와 ‘관리자’는 자주 호환되어 사용 되기도 합니다.
        보통 관리자 중에 리더도 있지만 둘 사이에는 미묘한 차이점이 존재합니다.
        관리자가 아니어도 리더가 될 수 있고 리더가 아니라도 관리자가 될 수
        있습니다. 리더와 관리자의 차이를 살펴보도록 하겠습니다..
        <br />
        <br />
        <MiniText>변혁 vs 조직</MiniText>
        <Subtitle>
          리더는 새로운 아이디어를 추구하고 창의력을 발휘해 팀에 에너지를 불어
          넣고자 할 것입니다. 이러한 특성이 부족한 관리자의 경우 틀에 박히지
          않고 독창적인 사고를 하기보다는 조직이 그저 잘 운영되고 효율적인지만
          강조하게 됩니다.
        </Subtitle>
        <MiniText>신뢰 vs 통제</MiniText>
        <Subtitle>
          리더는 자신의 팔로워와 신뢰를 구축합니다. 모범을 보이며 굳건한
          가치관을 갖추고 있으며 이는 정직함과 성실함이 큰 역할을 합니다. 반면,
          관리자는 신뢰대신 통제를 통한 그들의 지휘권에 의존하게 됩니다.
        </Subtitle>
        <MiniText>‘무엇을’, ‘왜’ vs ‘어떻게’, ‘언제’</MiniText>
        <Subtitle>
          리더는 업무지시를 할 때 ‘무엇을?” “왜?” 같은 중요한 질문을 던지며
          주어진 권한과 현재 상황을 생각해 보도로 합니다. 이와 달리 관리자는
          요청 받은 일을 어떻게, 언제 해낼 수 있을지에 만 더 관심을 가집니다.
        </Subtitle>
        <Poem>
          Managers light a fire under people. Leaders light a fire in people.
          <br />
          관리자는 재촉하고, 리더는 동기를 부여합니다.
          <br />
        </Poem>
        <CenterSubtitle>- Kathy Austin</CenterSubtitle>
      </Subtitle>
      <Subheading>리더십의 기술</Subheading>
      <Subtitle>
        리더십이 무엇인지, 리더십의 유형, 리더와 경영자의 차이를 살펴봤습니다.
        하지만 리더는 어떤 기술을 갖춰야 하고 어떻게 기술을 익혀야 하는지
        알아보도록 하겠습니다.
        <IndentUnderlineHeading>의사소통</IndentUnderlineHeading>
        <IndentSubtitle>
          리더는 팀원과 소통을 원활하게 할 수 있어야 하는 것처럼 회사내 전 직원
          및 협력사들과도 효과적으로 소통할 수 있어야 합니다. 그것이 일대일 대면
          상황이던 그룹 프리젠테이션이던 명확한 방식으로 소통하는 것이 가장
          중요합니다.
          <br />
          <br />
          의사소통 능력을 향상시키는 방법: 의사소통에서 가장 중요한 부분은
          경청입니다. 주변사람들의 말을 잘 경청하도록 충분한 시간을 할애 해야
          합니다. 팀원과 주기적으로 소통하여 업무 진행과정에서 서로 같은 이해를
          하고 있는지 확인 하여아 합니다.
        </IndentSubtitle>
        <IndentUnderlineHeading>유연성</IndentUnderlineHeading>
        <IndentSubtitle>
          어느 산업분야이던 변화는 불가피합니다. 유연한 접근방식을 가지고
          지나치게 한가지 방식에 얽매이지 않도록 해야 합니다. 가장 중요한 것은
          변화에 적응하고 피드백을 주고받으면서 팀원들을 동참할 수 있도록 이끌어
          주는 것입니다.
          <br />
          <br />
          유연성을 키우는 방법: 팀원들에게 변화를 통해 이익을 얻는 부분이
          있는지에 대한 주기적인 피드백을 들어 보십시요. 정기적으로 진행 과정을
          검토하고 거듭 질문해 보세요 “여전히 잘 운영되고 있습니까?”
        </IndentSubtitle>
        <IndentUnderlineHeading>권한위임</IndentUnderlineHeading>
        <IndentSubtitle>
          누구든지 너무 많은 업무를 받다 보면 일에 압도당하기 마련이기 때문에
          리더는 권한 위임을 잘 해야 합니다. 팀원들의 강점과 능력들을 파악하는
          것이 효과적으로 권한위임 할 수 있게 하며, 리더의 업무량을 줄이고
          팀원들에게 더 많은 기회를 갖게 하여 그들의 업무능력을 더욱 발전
          시키도록 합니다.
          <br />
          <br />
          권한위임을 잘하는 방법: 팀원들에게 본인들이 어떻게 발전할지, 자신의
          강점이 무엇인지 질문해보십시오. 업무나 프로젝트를 분장할 때 어떻게
          그들을 발전시키고 어느 업무들을 팀원들에게 위임할 수 있는지 확인해
          보십시요.
        </IndentSubtitle>
        <IndentUnderlineHeading>피드백</IndentUnderlineHeading>
        <IndentSubtitle>
          유용하고 긍정적인 피드백을 제공하는 것은 리더로서 가져야 할 중요한
          요소입니다. 너무 세세한 것까지 컨트롤하지 않으면서 피드백을 줄 수 있는
          방법을 살펴봐야 합니다. 팀원들이 업무 향상시키며 독립적으로 일을
          수행할 수 있도록 가르쳐주는 것이 위임에도 도움이 됩니다.
          <br />
          <br />
          다양한 피드백을 제공하는 방법: 월별 면담과 같이 일대일로 피드백을 받을
          수 있도록 일정 시간을 활용해봅니다. 팀원의 업무를 잘 처리했다면 이를
          알려줄 수 있습니다. 한편 팀원이 어려움을 겪고 있다면 진솔한 대화를
          통해 그들의 실력을 발전시킬 수 있도록 도움을 주십시오.
        </IndentSubtitle>
        <IndentUnderlineHeading>창의성</IndentUnderlineHeading>
        <IndentSubtitle>
          어디에나 확실한 정답은 존재하지 않기 때문에 리더는 창의적으로 사고할
          수 있어야 합니다. 리더가 갖춰야 할 핵심 기술은 고정관념에서 벗어나고
          한계를 뛰어넘는 것입니다.
          <br />
          <br />
          창의적 사고를 키우는 방법: 업무 외 일상 생활에서 두뇌를 깨울 수 있는
          창의적인 취미를 찾아 보십시오. 그리고 어려운 문제나 아이디어가
          제시되면 안전하고 일반적인 선택을 택하기 보다는 팀원과 아이디어에 대해
          의논하여 창의적인 활동을 이끌어 보십시오.
        </IndentSubtitle>
        <IndentUnderlineHeading>신뢰성</IndentUnderlineHeading>
        <IndentSubtitle>
          신뢰는 리더에 대한 팀원의 믿음을 이끌어 냅니다. 리더가 정직하고 신뢰가
          있다면 사람들이 더욱 호감을 가지고 따를 <br />
          것입니다. 신뢰를 쌓는 방법: 팀에 정직한 리더가 되는 것이 신뢰를 쌓는
          가장 좋은 길 입니다. 자신의 경험을 이야기 하며 <br />
          자주 소통하고 어떠한 대화도 회피하지 마십시오.
        </IndentSubtitle>
        <Poem>
          The ability to learn is the most important quality a leader can have.
          <br />
          학습 능력은 리더가 갖출 수 있는 가장 큰 자질이다.
        </Poem>
        <CenterSubtitle>- Sheryl Sandberg</CenterSubtitle>
        <IndentUnderlineHeading>사기, 의욕*</IndentUnderlineHeading>
        <IndentSubtitle>
          직장은 스트레스가 가득한 곳이 될 때도 있습니다. 긍정적인 태도를 가지고
          의욕을 유지할 수 있도록 하는 것이 훌륭한 리더십의 기술이라고 할 수
          있습니다. 환경이 긍정적일 때 팀원들도 스트레스를 잘 견디고 즐기며 일을
          할 수 있습니다.
          <br />
          <br />
          의욕을 불어넣는 방법: 팀원들과 업무와 관련 없는 주제와 일상에 대한
          대화를 하고 직장 밖에서 어울려 보십시오. 그리고 서로를 알아 갈 수
          있도록 직장에서도 재미있는 시간을 가져보십시오.
        </IndentSubtitle>
        <IndentUnderlineHeading>동기</IndentUnderlineHeading>
        <IndentSubtitle>
          리더는 직원들에게 금전적인 인센티브 제공 이상의 동기를 부여할 수
          있어야 합니다. 자존감을 높이고, 업무 목표를 구축하고 업무에 대한
          지속적인 보상 제공은 일에 대한 동기가 될 수 있습니다.
          <br />
          <br />
          팀에 동기를 부여하는 방법: 팀원들과 미래의 비전을 공유하고 팀 개별로
          각자의 포부를 나누어 보십시오. 주기적인 피드백 시간이나 개별 면담을
          통해 진행할 수 있습니다.
        </IndentSubtitle>
      </Subtitle>
      <Subheading>리더십 코칭의 역할</Subheading>
      <Subtitle>
        앞에서 살펴본 것과 같이 강한 리더가 되기 위한 다양한 기술이 필요합니다.
        누군가의 도움 없이 스스로도 개발할 수 있지만 어떤 특정한 부분에 어려움을
        겪는다면 전문적인 도움이 필요한 경우가 많습니다.
        <br />
        <br />
        리더십 코치들은 여러분이 큰 기업에 속해 있던 자영업을 하던 여러분의
        리더십 기술을 발전시키기 위한 전문적인 지식과 경험을 갖추고 있습니다.
        목표를 정하고 진행 상황을 수시로 점검할 수 있도록 코치는 여러분과
        협력하여 실력 향상이 되도록 책임지고 지도할 것입니다.
        <br />
        <br />
        리더십 코치들은 여러분의 코칭 실력도 향상시켜 스스로가 팀원을 도울 수
        있도록 해드릴 것 입니다. 코칭에 대한 자세한 정보를 알아보고 주변에서
        리더십 코치를 찾아보세요.
      </Subtitle>
    </>
  );
};

export default TextFormat;
