import React from "react";

import {
  Heading,
  Subheading,
  Subtitle,
  TopLine,
  UnderlineHeading,
  IndentSubtitle,
  IndentUnderlineHeading,
  Poem,
  CenterSubtitle,
  MiniText,
  BoldHeading,
  BoldList,
  HighlightedText,
  HyperLink,
} from "./InfoElements";

const TextFormat = ({}) => {
  return (
    <>
      <TopLine>Retirement</TopLine>
      <Subheading>은퇴</Subheading>
      <Subtitle>
        오랜 직장생활을 끝내고 맞는 은퇴는 진정한 휴식처럼 느껴질 겁니다.
        여러분의 상당 수가 은퇴 후 시간은 무엇이 우리에게 중요한지, 업무에 대한
        압박 없는 하루를 어떻게 보낼 것 인지에 대해 다시 생각해 보는 시간이라
        생각합니다.
        <br />
        <br />
        그러나 너무 당연하게도, 이러한 인생의 전환기는 여러가지 문제들과 걱정을
        가져올 수 있습니다. 일 없이도 여전히 “우리”로 남아 있을 수 있을까?
        친구들과 연락이 끊기는 거 아닌가? 흥미진진한 새로운 챕터라기 보다,
        힘들게 느껴질 수 있으며 상실감과 혼란을 줄 수 있습니다. 그렇기에 많은
        사람들이 이러한 시기에 코칭을 받는 이유입니다.
        <br />
        <br />
        코치와 함께 앞으로 여러분에게 다가올 문제나 역경을 다루고, 여러분의 길을
        다시 찾는데 도움이 될 수 있습니다. 여기서 우리는 은퇴와 함께 찾아오는
        도전과 기회, 그리고 이러한 시간들을 최대한 활용하는 데에 코치가 어떠한
        도움을 줄 수 있는지 살펴볼 것입니다.
      </Subtitle>
      <Subheading>언제 은퇴할 수 있을까?</Subheading>
      <Subtitle>
        우리는 나이가 들어가면서, 이러한 질문을 계속하게 됩니다. 나는 언제
        은퇴할 수 있을까? 과거에는 여러분이 은퇴를 원하든 원하지 않든 지정된
        은퇴할 나이 가 정해져 있었습니다. 이러한 추세는 바뀌었고, 현재는
        여러분이 언제 은퇴할지 선택할 수 있게 되었습니다.
        <br />
        <br />
        여러분은 은퇴할 시기를 선택할 수 있지만, 여전히 국민 연금 수령은 지정된
        나이까지 기다려야 합니다.
        <br />
        <br />
        국민연금공단은 여러분의 연금 나이와 예상수령액을 조회할 수 있는 사이트를
        제공하고 있으며 <br /> (https://www.nps.or.kr/jsppage/csa/csa.jsp) 이는
        여러분이 언제 은퇴할 지 결정하는데 좀더 도움을 줄 것 입니다.
      </Subtitle>
      <Subheading>은퇴 계획</Subheading>
      <Subtitle>
        우리는 이제 “적절하다”고 느끼는 시기에 은퇴할 수 있지만, 그 “적절한”
        때가 언제 인지 어떻게 알 수 있을까요?
        <br />
        <br />
        직장에서 스트레스를 받을 때 우리 대부분은 언제 정년이 올까 하며
        정년이후의 호사스러운 삶에 대해 농담을 나눕니다. 우리 모두가 은퇴 후
        호사로운 삶을 누릴 수 있는 것이 아닐지라도, 우리는 좀 더 편안한 삶의
        방향으로 변화하기 위해 일찍이 퇴직 연금 등에 투자를 시작하라고 권고 받곤
        합니다.
        <br />
        <br />
        여러분의 퇴직소득을 계획하기 위해 여러 금융기관에서 은퇴 후 재무적
        독립을 위해 제공하는 여러가지 플랜들을 검토해 볼 수 있을 겁니다. 하지만
        은퇴가 개인적으로 영향을 주는 측면에 대해서는 거의 고려하지 않으며 이
        거대한 전환기가 심리적, 감정적인 차원에서 어떻게 우리에게 영향을 미치는
        지에 대해서도 거의 생각하지 않는 것 같습니다.
        <br />
        <br />
        은퇴는 더 나은 라이프 스타일로 변화시킬 수 있는 아주 좋은 기회라고
        생각할 수 있지만 우리 대부분은 그것이 어떤 모습일지에 대한 이상적인
        그림만 그려볼 뿐 현실과는 다를 수 있습니다.
      </Subtitle>
      <Subheading>은퇴의 문제점</Subheading>
      <Subtitle>
        새로운 생활방식에 적응하고, 수십년 동안 여러분의 삶의 일부였던 무언가를
        버리는 것은 어떤 사람들에게는 어려울 수 있습니다. 이러한 과도기의
        과정에서 발생할 수 있는 몇 가지 어려움이 있을 것입니다.
        <IndentUnderlineHeading>사회적 관계 상실감</IndentUnderlineHeading>
        <IndentSubtitle>
          직장에 소속되어 있으면 팀 내에서 든 고객들과 함께 든 정기적으로 다른
          사람들과 교류할 수 있는 기회를 만들 수 있습니다. 대화를 많이 하지 않는
          환경이라도, 다른 사람들과 함께 있으면서 이들과 교류한다는 느낌은
          집에서 혼자 경험할 수 없는 편안함이자 안락함입니다.
          <br />
          <br />
          우리가 은퇴를 하면, 인간관계 뿐만 아니라 비전과 공동의 목표를 공유했던
          조직의 소속감을 잃어버릴 수 있습니다. 생활방식과 일상의 변화는 일로
          맺어진 관계를 유지하기 어렵게 되며, 몇몇 사람들과는 연락이 끊길 수
          있을 겁니다.
          <br />
          <br />
          여러분의 삶에 남겨두고 싶은 사람들과 꾸준히 연락하며 관계를 유지하도록
          하는 노력은 진정한 차이를 만들 수 있습니다.
          <br />
          <br />
          은퇴 기간 동안 관심있는 그룹에 가입하거나 새로운 기술을 배우고,
          커뮤니티에 더 많이 참여하는 것은 새로운 삶의 장으로 나아가게끔 하며,
          사회적 도움을 다시 찾을 수 있게 도움을 줄 겁니다.
        </IndentSubtitle>
        <IndentUnderlineHeading>건강 문제/걱정</IndentUnderlineHeading>
        <IndentSubtitle>
          우리가 나이가 들면서, 대부분의 사람들은 젊었을 때 보다 더 건강에 관해
          걱정한다는 것을 알 수 있습니다. 우리가 은퇴할 때 쯤, 우리의 일상에서의
          급격한 변화와 이러한 건강 문제가 합쳐져서 많은 활동을 할 수 없는
          생활을 하게 될 수도 있을 지도 모릅니다.
          <br />
          <br />
          우리가 미리 준비하거나 피할 수 없는 건강 문제들도 있지만, 활동적이고
          건강을 향상시키는 생활방식으로 살아간다면, 우리는 우리 자신에게 활기
          있고 동기 부여할 수 있는 최고의 기회를 줄 수 있습니다. 이는 밖에서
          산책을 하거나 매일 정원을 가꾸는 것만큼 간단할 수 있으며, 변화하는
          건강과 영양 상태를 유지하기 위해 더 공부하거나, 심지어 피트니스 센타의
          수업에 참여하여 완전히 새로운 것을 시도하는 것처럼 단순할 수 있습니다.
        </IndentSubtitle>
        <IndentUnderlineHeading>가족 및 부부 관계 문제</IndentUnderlineHeading>
        <IndentSubtitle>
          은퇴는 가족과의 관계에도 변화를 가져올 수 있습니다. 미칩니다. 배우자와
          함께 은퇴하게 되거나 먼저 은퇴하게 될 수도 있습니다. 오랜 시간 동안
          함께하다는 것은 어떤 사람들에게는 멋지고 다른 누군가에게는 구속으로
          느껴질 수도 있습니다. 아마 당신의 가족 중에는 여러분이 마주하고 있는
          감정들을 이해하지 못할 것입니다.
          <br />
          <br />
          여러분의 상황이 어떻든지 간에, 여러분의 은퇴에 영향을 받을 사람들과
          함께 이러한 변화에 대해 이야기해보는 시간을 갖는 것이 도움이 될 수
          있습니다. 여러분 모두가 어떤 영향을 받을지 계획할 수 없기에, 은퇴한
          후에 가족 모두의 기분과 그들이 무엇을 필요로 하는지 알기 위해
          정기적으로 체크를 하는 것이 도움이 될 수 있습니다.
        </IndentSubtitle>
        <IndentUnderlineHeading>정체성 상실</IndentUnderlineHeading>
        <IndentSubtitle>
          우리의 직업으로 우리가 누구인지 정의 내릴 수 없지만, 직업은 우리의
          관심사와 열정을 반영하며, 종종 우리의 정체성과 얽혀 있습니다.
          <br />
          <br />
          우리의 대다수는 각자의 위치에서 잘해 내기 위해 노력하며, 종종 삶의
          다른 영역으로부터 벗어나 기분전환과 휴식을 찾기 위해 직업을 찾습니다.
          이 모든 것을 고려한다면, 우리가 일터에서 물러날 때 어떤 사람들은
          자신의 정체성과 목적 의식을 잃었다고 느끼는 것은 놀랄 일도 아닐 것
          입니다.
          <br />
          <br />
          일에서 벗어난 여러분은 누구인지 이해하는 것이 여기서의 핵심입니다.
          여러분은 여전히 정체성을 가지고 있으며, 지금이 이러한 정체성의 다른
          측면을 탐구하는 데 있어 완벽한 시기일 수도 있습니다. 여러분의 목적은
          그대로 유지되거나 여러분과 함께 발전될 수도 있으며 이를 성취하기 위한
          다른 방법들이 있는 것입니다.
        </IndentSubtitle>
      </Subtitle>
      <Poem>
        Retirement isn't the end it used to be considered as, but a new
        beginning of the life you want to live and a chance to really live your
        dreams now!
        <br />
        <br />
        은퇴는 끝이 아니라, 여러분이 살고 싶은 삶의 새로운 시작이자 여러분의
        꿈을 진정으로 살 수 있는 기회입니다!
        <br />
        <br />- Life coach Julie Crowley 라이프 코치 줄리 크라울리
      </Poem>
      <br />
      <Subheading>어떻게 하면 만족스러운 은퇴를 할 수 있을까요?</Subheading>
      <Subtitle>
        은퇴를 곧 하게 되어 불안하다면, 이에 대해 생각하고 은퇴 계획을 세우는
        것이 도움이 될 수 있습니다. 이는 여러분이 은퇴에 대해 미리 준비하게끔
        하며, 일을 그만두는 시점이 왔을 때, 할 일이 없어졌다고 생각하지 않게끔
        도와줍니다.
        <br />
        <br />
        새로운 일상을 만드는 것이 핵심이며, 위에서 언급한 모든 어려움을 고려하고
        이러한 어려움들을 어떻게 해결할 수 있는지도 생각 해야 합니다. 아래는
        새로운 루틴을 만들어 시간을 보낼 수 있는 일상의 예들을 소개해 보도록
        하겠습니다.
      </Subtitle>
      <Subheading>어떻게 하면 만족스러운 은퇴를 할 수 있을까요?</Subheading>
      <Subtitle>
        은퇴를 곧 하게 되어 불안하다면, 이에 대해 생각하고 은퇴 계획을 세우는
        것이 도움이 될 수 있습니다. 이는 여러분이 은퇴에 대해 미리 준비하게끔
        하며, 일을 그만두는 시점이 왔을 때, 할 일이 없어졌다고 생각하지 않게끔
        도와줍니다.
        <br />
        <br />
        새로운 일상을 만드는 것이 핵심이며, 위에서 언급한 모든 어려움을 고려하고
        이러한 어려움들을 어떻게 해결할 수 있는지도 생각 해야 합니다. 아래는
        새로운 루틴을 만들어 시간을 보낼 수 있는 일상의 예들을 소개해 보도록
        하겠습니다.
      </Subtitle>
      <Subheading>자원봉사 고려해보기</Subheading>
      <Subtitle>
        여러분이 새로운 인맥을 만들고 여러분의 지역사회에 뭔가 돌려주고 싶다면,
        자원봉사는 시간을 보내는 매우 보람 있는 방법입니다.
        <br />
        <br />
        그동안 수년 간의 근무 기간 동안 쌓은 전문적인 기술 뿐만 아니라 인생
        경험도 더욱 유용하게 활용될 수 있을 겁니다. 지역사회나 공공기관에서의
        봉사, 재능 나눔 혹은 환경 프로젝트에 참여하거나 자선행사에서 일하기 등
        여러분에게 맞는 자원 봉사 일 자리가 많이 있습니다.
        <br />
        <br />
        봉사활동에 관심이 있고, 여러분의 지역에서 기회를 찾고 싶다면, 직접
        정부의 자원봉사 일자리 센터 페이지를 방문하시면 됩니다.
      </Subtitle>
      <Subheading>아르바이트 (시간제 일자리) 알아보기</Subheading>
      <Subtitle>
        여러분이 약간의 추가적인 실소득을 원하거나, 단순히 직장 생활의 환경이나
        도전들이 그립다면, 아르바이트 같은 시간제 고용이 좋은 선택일 겁니다.
        시간제 고용은 정규직에서 오는 역할의 책임과 압박감 없이 여러분을
        활동적이게 만들며, 일상의 루틴과, 안정성, 도전 그리고 새로운 사람을 만날
        수 있는 기회를 제공합니다.
      </Subtitle>
      <Subheading>새로운 취미 발견 또는 새로운 기술 배우기</Subheading>
      <Subtitle>
        은퇴는 여러분이 하고 싶었지만 이전에는 할 수 없었던 모든 것들을 시작할
        수 있는 환상적인 기회입니다. 세계 여행부터 사교 댄스를 시작하는 것까지,
        이런 취미활동은 여러분이 좋아하는 것들을 하면서 시간을 보내고, 사람들과
        잘 어울릴 수 있는 가장 좋은 방법입니다.
        <br />
        <br />
        골프, 수영 그리고 자전거 타기와 같은 몸을 움직이는 취미들은 신체적으로
        활동적인 상태를 유지하는데 도움이 되는 반면, 정원 가꾸기, 사진촬영, 예술
        및 공예와 같은 창의적인 취미들은 마음 속에 도전의식을 북돋울 것입니다.
      </Subtitle>
      <Subheading>사회 활동 계속 유지하기 </Subheading>
      <Subtitle>
        여러분이 혼자 살거나 배우자와 산다면, 나가서 다른 사람들과 어울려 보도록
        노력해보세요. 친구들과 매주 식사하는 클럽을 준비하는 것에서부터 지역
        독서 클럽에 가입하는 것까지 여러분의 사교계를 넓히는 것은 행복한 은퇴에
        있어 중요한 역할을 할 것입니다.
      </Subtitle>
      <Subheading>
        코치가 은퇴 계획을 세울 수 있게 어떻게 도움을 주나요?
      </Subheading>
      <Subtitle>
        은퇴와 같은 삶의 변화에 대비하는 것은 변화를 쉽게 받아 들이게 하는 가장
        좋은 방법 중 하나이며, 여기서 코치의 전문성이 발휘됩니다. 은퇴 계획을
        세우는 데에 도움을 줄 것이며, 일을 그만 뒀을 때 시간을 어떻게 보낼지에
        대해 생각해 보며 방안을 모색하는데 도움이 될 수 있습니다.
        <br />
        <br />
        코치들은 또한 여러분이 은퇴에 대해 가질 수 있는 두려움을 해결하는 데에
        도움을 주고, 변화에 대비할 수 있도록 도움을 줄 수 있습니다. 코치와 함께
        일하면서 여러분이 은퇴에 대한 성취감과 행복을 느끼도록 도움을 줄 새로운
        목표들을 세울 수 있습니다.
        <br />
        <br />
        인생의 새로운 챕터에서 무엇을 하고 싶은지에 대한 명확한 비전을 세우는데
        도움을 드리며, 여러분의 코치는 다음과 같은 일련의 질문을 던지며 코칭을
        시작할 것입니다.
        <br />
        <br />
        <ul>
          <li> 은퇴에 대한 여러분의 기분은 어떠 한가요?</li>
          <br />
          <li> 은퇴를 어떻게 보내고 싶나요?</li>
          <br />
          <li> 어떠한 기대나 예상을 하고 있나요?</li>
          <br />
          <li> 여러분이 은퇴했을 때 어떤 생활방식의 변화를 가지고 싶나요?</li>
        </ul>
      </Subtitle>
      <Subtitle>
        여러분의 대답은 코치가 여러분의 기분이 어떠하며, 은퇴 시기에 무엇을
        원하는지를 이해하는데 도움이 될 것입니다. 이는 여러분이 앞으로
        나아가는데 필요한 기초를 만들어 줄 것입니다.
        <br />
        <br />
        정기 코칭 세션은 은퇴를 앞두거나 은퇴시기 동안 여러분이 가질 수 있는
        두려움이나 걱정을 파악하여 이를 해결할 수 있도록 도와줄 것입니다. 코칭은
        또한 여러분의 주요 동기, 가치, 능력, 관심사를 이해하여 여러분이 은퇴 후
        삶에서 무엇을 원하는지 명확한 그림을 그릴 수 있도록 도움을 드릴
        것입니다.
        <br />
        <br />
        <br/>
        <br/>
        <HighlightedText>이러한 새로운 챕터에 도움을 받고 싶다면, 마음에 맞는 코치를 찾아보세요.</HighlightedText>
      </Subtitle>
    </>
  );
};

export default TextFormat;
