import React from "react";

import {
  Heading,
  Subheading,
  Subtitle,
  TopLine,
  UnderlineHeading,
} from "./InfoElements";


const TextFormatBusiness = ({}) => {
  return (
    <>
      <TopLine>Business Coaching</TopLine>
      <Heading>비즈니스 코칭</Heading>
      <Subtitle>
        비지니스 코칭은 영업을 관장하는 책임자와 그들의 팀원이 영업목표를 성취할
        수 있도록 돕는 것을 목표로 합니다. 비즈니스 코치는 사업 계획과 전략을
        짜고 매일의 일과를 동시에 지원함으로써 비즈니스가 성장되도록 도와줍니다.
        <br />
        <br />
        사업을 시작하고 운영하는 것은 누구에게나 그 과정속에서 습득하고 경험하게
        됩니다. 이 과정에서 비지니스 코치가 지지해주고 가이드도 해주면서 도움을
        준다면 큰 차이가 나타날 것입니다.
        <br />
        <br />
        비즈니스 코치는 의뢰인으로 하여금 자신의 강점을 발견하고 약점을 보완하며
        새로운 기술을 배워 자신의 사업 분야에서 뛰어난 역량을 발휘하도록
        도와줍니다. 비즈니스 코칭의 세계와 코칭이 어떻게 도움이 될 수 있는지
        자세히 알아보도록 하겠습니다.
      </Subtitle>
      <Subheading>비지니스 코치가 어떤 도움을 줄 수 있나요?</Subheading>
      <Subtitle>
        비지니스 코치는 여러분의 상황에 대해 제 3자의 입장에서 객관적이며
        건설적인 관점을 알려줌으로써 여러분에게 도움을 드릴 수 있습니다. 사업은
        다양한 영역으로 구성되어 있어서 대중 연설 전문가, 전략 및 관리 전문가 등
        각자의 영역에서 전문가 코치들을 만나 보실 수 있습니다. 비지니스 코치를
        정하기전에, 코치가 여러분이 다루기를 원하는 영역의 코칭 경험이 있는지
        먼저 확인하셔야 합니다.
        <br />
        <br />
        여러분이 비지니스 코치가 필요할 만한 몇 가지 경우를 살펴보도록
        하겠습니다.
      </Subtitle>
      <UnderlineHeading>
        점 더 나은 대중 연설을 하고자 하는 경우{" "}
      </UnderlineHeading>
      <Subtitle>
        여러 사람 앞에 나서서 연설을 하는 것을 생각만 해도 진땀이 난다던가,
        아니면 사람들에게 영감을 주는 인상적인 프리젠테이션을 해서 상대망을
        감동시키고 싶다면 비즈니스 코치가 필요할 것입니다. 대중 앞에서 연설
        경험이 많은 코치는 여러분이 떨지 않고 효과적인 연설을 할 수 있도록 지도
        할 것 입니다.
      </Subtitle>
      <UnderlineHeading>의사소통 능력을 향상시키고자 할 경우</UnderlineHeading>
      <Subtitle>
        의사소통 기술은 비지니스에서 매우 중요합니다. 의사소통 기술이
        부족하다면, 좋은 협상을 이끌어내지도, 동료들의 신뢰를 얻거나 상급자에게
        좋은 인상을 심어주지도 못할 것입니다. 애석하게도, 높은 수준의 소통
        기술은 자연적으로 얻어지는 것이 아닙니다. 수줍음, 낮은 자신감, 열등감
        등은 사업을 성공적으로 진행하는 데 방해가 될 수 있습니다. 비지니스
        코치는 여러분으로 하여금 소통이 어려운 근본적 원인을 파악하게 돕고,
        스스로에 대한 불신을 통제하고 자신감 있고 명확하게 소통할 수 있도록 도울
        것입니다.
      </Subtitle>
      <UnderlineHeading>새로운 사업을 시작하고자 하는 경우</UnderlineHeading>
      <Subtitle>
        스타트업 비즈니스 코칭은 창업을 하려는 사업가에게 꼭 필요한 지원과 안내,
        전문지식을 제공합니다. 스타트업은, 시작한 지 3년 이내에 절반 가까이 되는
        사업가들이 실패할 정도로 위험합니다. 관련 경험이 풍부한 코치와 함께
        하신다면 창업 기간 동안 필요한 가이드와 지원을 받을 수 있으며, 치명적
        실수를 최소화할 수 있을 것입니다.
      </Subtitle>
      <UnderlineHeading>팀을 관리하는 데 도움이 필요할 경우</UnderlineHeading>
      <Subtitle>
        팀을 관리하는 것은 매우 힘든 일일 수 있습니다. 첫째, 팀의 관리자는 높은
        통찰력을 필요로 합니다. 어떻게 하면 모든 팀원의 강점을 파악하고 잘
        활용할 수 있을까요? 팀원들이 협업할 때, 각자가 할 수 있는 최선을 쏟아
        부을 수 있게 하려면 어떻게 해야 할까요?
        <br />
        <br />
        둘째, 팀의 관리자는 높은 자신감과 리더십을 갖추어야 합니다. 관리자가
        자신감과 확신이 없어 보인다면 팀원들은 관리자를 신뢰하거나 존중하기
        어려울 것입니다. 리더십 기술에 전문화된 몇몇 코치는 여러분의 팀 및
        사업의 발전을 도울 수 있을 것입니다.
      </Subtitle>
      <UnderlineHeading>
        중요한 변화 및 중요한 결정이 요구되는 경우
      </UnderlineHeading>
      <Subtitle>
        기업 합병, 확장, 이전, 구조변화 등을 하려고 하신다면 신중한 결정이 매우
        중요합니다. 종종 여러분 자신 스스로는 사업의 전체적인 그림을 보기 힘드실
        수 있습니다. 특히 여러분과 사업 간의 감정적 유대가 끈끈하게 있을 경우 더
        그러합니다. 사업의 본래적 목적에 충실한 것도 중요하지만, 변화가 필요할
        때를 인식하는 것도 중요합니다.
        <br />
        <br />
        비지니스 코칭은 변화가 필요한 과도기에 지원을 제공하는 것은 물론,
        일반적인 상황에서도 편파적인 시각이 아닌 온전히 객관적인 관점을 갖게
        하는 것 또한 목표로 합니다. 공정한 시각으로 바라볼 경우 결단을 내리기가
        더 쉬워지는 경우가 종종 있습니다.
      </Subtitle>
      <UnderlineHeading>
        면접관으로서 면접기술을 발전시키고자 할 경우
      </UnderlineHeading>
      <Subtitle>
        신입사원을 면접할 때 몇 가지 어려움이 있을 수 있습니다. 면접대상자로부터
        최선의 반응을 이끌어내려면 어떻게 해야 할까요? 면접대상자에게 어떤
        질문을 해야 할까요? 면접대상자가 귀사에 적합한지 어떻게 알 수 있을까요?
        비지니스 코치는 효과적인 면접관이 되기 위한 실무 기술을 가르쳐 줌으로써
        전체적인 면접 과정을 더 명확하고 덜 긴장되게 만들 수 있습니다.
      </Subtitle>
      <UnderlineHeading>
        경계 설정 및 워라밸에 도움이 필요한 경우
      </UnderlineHeading>
      <Subtitle>
        직장인은 일에만 몰두하게 되기가 쉽습니다. 특히 힘든 프로젝트를 맡아 많은
        시간과 노력이 요구된다면 더욱 그러합니다. 일과 가정 사이에서 건강한
        균형을 찾기 어렵다면 비지니스 코치가 도움을 줄 수 있습니다. 업무의
        우선순위를 정하고, 시간 프레임을 정하고, 시간 관리 기술을 개발함으로써,
        여러분은 곧 가족, 친구, 취미, 일 모두에 적정한 관심과 시간을 쏟을 수
        있을 것입니다.직장인은 일에만 몰두하게 되기가 쉽습니다. 특히 힘든
        프로젝트를 맡아 많은 시간과 노력이 요구된다면 더욱 그러합니다. 일과 가정
        사이에서 건강한 균형을 찾기 어렵다면 비지니스 코치가 도움을 줄 수
        있습니다. 업무의 우선순위를 정하고, 시간 프레임을 정하고, 시간 관리
        기술을 개발함으로써, 여러분은 곧 가족, 친구, 취미, 일 모두에 적정한
        관심과 시간을 쏟을 수 있을 것입니다.
      </Subtitle>
      <UnderlineHeading>동기부여가 필요한 경우</UnderlineHeading>
      <Subtitle>
        동기부여의 하나의 문제점은 그것이 작심삼일에 불과할 수 있다는 것입니다.
        우리는 월요일에 눈을 뜨면서는 들뜬 마음으로 새로운 프로젝트를 시작 했을
        지 모르지만 수요일이 되면 그 열정은 식기 시작할 수 있습니다. 신생
        기업가에게는 일이 잘못되기 시작만 해도 계속 나아갈 동기를 유지하기 매우
        어려울 수 있습니다. 비지니스 코치는 단기 목표를 제시하고, 여러분으로
        하여금 하찮게 여겨질 수 있는 하루하루의 성취의 중요성을 인식하도록
        격려함으로써 계속 나아갈 동기를 부여해줍니다.
        <br />
        <br />
        또한 비지니스 코치는 여러분이 스스로 동기부여를 하도록 도와서, 어려운
        일이 닥쳐도 다시 일어나고, 실수에서 벗어나 새롭게 일상을 시작하도록 도와
        드릴 겁니다.
      </Subtitle>
      <Subheading>비지니스 코칭을 하는 데 시간이 얼마나 걸리나요?</Subheading>
      <Subtitle>
        코치들은 다양한 방법을 사용하므로, 코칭 세션의 횟수는 코치에 따라
        다양합니다. 여러분이 어떤 도움을 받고자 하는지에 따라 코칭 세션의 횟수가
        정해집니다.
        <br />
        <br />
        일반적으로 비지니스 코치는 코칭 의뢰인과 6개월에서 18개월 정도의 시간을
        보냅니다. 세션은 목표가 달성됐을 경우, 혹은 의뢰인이 그만두고자 할 경우
        종료됩니다. 코치는 의뢰인의 속도에 맞춰 작업을 진행하는 것을 목표로
        하고, 어떤 결정도 서두르지 않으며, 프로젝트 진행에 필요한 시간 이상을
        소요하지도 않습니다.
      </Subtitle>
      <Subheading>어떤 코치를 선택해야 하나요?</Subheading>
      <Subtitle>
        의뢰인은 비즈니스 코치와 긴밀하게 협력하여 코치로부터 전문지식을
        습득하게 됩니다. 따라서 코치와 좋은 <br />
        라포(친밀한 관계)를 형성하는 것이 매우 중요합니다. 어떤 코치가
        여러분에게 좋은 코치인지를 판단하는 데 가장 좋은 방법은 코치의 경험을
        확인함으로써 여러분과 추구하는 가치가 일치하는지 확인하고, 코치를 직접
        만나보고 자신의 직감을 따르는
        <br />
        것입니다. 자신이 선택한 코치의 의도나 진실성, 가치관에 대해 의심이
        든다면 주저하지 말고 다른 코치를 선택하십시오.
        <br />
        <br />
        (준비가 되었다면 검색도구를 이용해 비지니스 코치를 검색해보십시오.)
      </Subtitle>
      <Subheading>비지니스 코칭의 비용은 어느 정도인가요?</Subheading>
      <Subtitle>
        예상 가격은 아래와 같은 사항들을 포함한 다양한 요소를 감안하여
        결정됩니다.
        <br />
        <br />
        &#x2780; 직장의 위치
        <br />
        직장의 위치에 따라 코칭 요금에 영향을 줄 수 있습니다.
        <br />
        <br />
        &#x2781; 요구사항의 복잡성
        <br />
        귀사가 다국적 기업으로서, 조직 재편성을 위해 비지니스 코치를 고용하는
        경우라면 프레젠테이션 스킬 향상을 위해 단기 세션을 진행할 때보다는
        요금이 비쌀 것입니다. 예상 가격은 아래와 같은 사항들을 포함한 다양한
        요소를 감안하여 결정됩니다.
        <br />
        <br />
        &#x2782; 코치의 전문성
        <br />
        만약 당신이 최고 수준의 경영진을 지도하는 전문지식을 갖춘 세계적으로
        유명한 코치를 고용한다면 상당한 비용이 소요될 것입니다.
        <br />
        <br />
        &#x2783; 의뢰인의 수
        <br />
        1:1코칭보다 그룹 코칭이 더 저렴합니다.
        <br />
        <br />
        일반적으로 첫번쨰 상담은 무료로 제공됩니다. 첫번째 상담은 여러분의
        요구사항 및 목표를 상의하고, 코치의 성격 및 작업 방식에 대해 알기 위한
        짧은 대화입니다.
        <br />
        <br />
        당신의 경력, 사업, 그리고 스스로의 이익을 위해 신중하게 코치를
        고르십시오. 목표를 달성하기 위해 성급히 서두르지 않아도 됩니다. 도움을
        요청한다는 것은 자랑스러워 해야 할 일이며, 올바른 방향으로 나아가는 큰
        발걸음일 될 것 입니다.
      </Subtitle>

    </>
  );
};

export default TextFormatBusiness;
