import React from "react";

import {
  Heading,
  Subheading,
  Subtitle,
  TopLine,
  UnderlineHeading,
  IndentSubtitle,
  IndentUnderlineHeading,
  Poem,
  CenterSubtitle,
  MiniText,
  BoldHeading,
  BoldList,
  HighlightedText,
} from "./InfoElements";

const TextFormatExec = ({}) => {
  return (
    <>
      <TopLine>Executive coaching</TopLine>
      <Heading>임원 코칭</Heading>
      <Subtitle>
        임원 코칭은 능력 개발과 향상된 자신감 및 집중력을 통해 실적을 개선시킴
        으로써 개인과 회사 모두에게 도움을 줍니다. 임원 코치는 임원, 종종 높은
        잠재력을 가진 직원들과 같은 프로페셔널 들과 함께 일하고 있는 자격을 갖춘
        전문가들입니다. 임원 코치들은 여러분께 다음의 주제들과 관련하여 도움을
        드립니다.
        <br />
        <br />
        <ul>
          <li> 본인의 목표 더 이해하기</li>
          <li> 자기자신에 대하 알기</li>
          <li> 성장을 위한 목표들 달성하기</li>
          <li>잠재력 발휘하기</li>
        </ul>
      </Subtitle>

      <Subheading>임원 코칭이란 무엇인가요?</Subheading>
      <Subtitle>
        임원 코칭은 주로 직장에서의 성과와 행동을 향상시키는 데에 초점을 둡니다.
        개인들을 빠르게 발전시키도록 고안된, 임원 코칭은 바쁜 임원 들을 위해
        만든 목표 지향적 형태의 맞춤 학습입니다.
        <br />
        <br />
        몇몇 형태의 코칭은 좀 더 장기적이고 개인적인 구성방식을 요구하지만, 임원
        코칭은 단기적이며, 제한된 시간을 활용하는 과정으로 목표 지향적이며 행동
        지향적입니다. 임원 코칭은 피드백을 활용하여 어느 정도의 객관성을
        제공합니다. 임원 코치는 컨설턴트나 상담가가 아니기에, 일반적으로 조언을
        직접 하거나 문제를 해결하지 않습니다. 대신, 코치는 경청하고 여러분의
        목표를 더 이해하고 문제 해결을 돕기 위해 관련 질문들을 합니다.
      </Subtitle>

      <Subheading>임원 코칭의 장점은 무엇인가요?</Subheading>
      <Subtitle>
        임원 코칭은 여러분과 여러분이 근무하고 있는 조직에 많은 장점들을 가져다
        줍니다. 임원 코칭은 비용이 비싸지만, 직원들의 능력이 향상되고 실적이
        개선되므로 투자 할 가치가 있다고 말합니다. 아래에, 개인과 조직에게 임원
        코칭이 주는 혜택에 대해 알아보겠습니다.
      </Subtitle>
      <br />
      <Subheading>여러분 스스로에게 주는 이점들</Subheading>
      <Subtitle>
        만약 여러분이 임원 코칭을 찾고 있다면, 이는 여러분이 임원으로써 일을
        하고 있거나, 커리어를 잘 관리하고 있는 성과가 좋은 직원일 것입니다. 임원
        코칭은 여러분이 임원으로 성공할 수 있도록 도와드리고 있으며, 성공하고
        번창하기 위하여 여러분이 발전시켜야 할 특정한 기술들을 다룹니다.
        <br />
        <br />
        임원 코칭은 다음 사항에 대해 도와드릴 수 있습니다.
        <br />
        <br />
        <ul>
          <li> 성공적으로 임무를 완수하기 위해 시간을 효율적으로 관리하기</li>
          <li>
            {" "}
            스트레스 요인을 이해하고 잠재적인 주변자극에 대처하는 방법 배우기
          </li>
          <li> 경계선을 찾아 일과 삶의 균형을 잘 만들고 유지하기</li>
          <li> 발전할 시간을 갖고 성취할 수 있는 목표 세우기</li>
          <li> 여러분의 창의력과 지적인 자유 실천하기</li>
        </ul>
      </Subtitle>
      <Subtitle>
        임원 코칭은 기밀 문제들이나 여러분에게 중요한 문제들에 대해 깊이
        생각하고 재 집중할 수 있도록 안전한 환경을 제공 드리고 있습니다.
        여러분이 고위 임원 이 될수록 불규칙하게 발생되는 것들에 대해서 코치는
        여러분의 자문역이 될 수 있습니다. 임원 코칭은 여러분이 고려하고 있는
        결정들을 내릴 수 있도록 하고 자유로운 방식으로 자신의 견해에 도전할 수
        있도록 도와드리고 있습니다.
        <br />
        <br />
        임원 코칭은 여러분이 자신의 역할에서 무엇을 원하는지, 미래에 어디에
        있기를 희망하는지에 대해 이야기할 수 있는 공간을 제공합니다. 새로운
        기술들이나 도전적인 영역이나 잠재적으로 새로운 영역을 경험할 때도
        여러분의 지지자가 되어드리며, 당신이 계속해서 앞으로 나아갈 수 있는
        자신감을 느낄 때까지 여러분의 멘토로서의 역할을 할 것입니다.
      </Subtitle>
      <Subheading>고용주에게 주는 혜택들</Subheading>
      <Subtitle>
        직원들을 위해 임원 코칭에 투자하는 조직들은 많은 혜택을 얻을 수
        있습니다. 행복한 직원이라하면 궁극적으로 성과가 좋은 인력들일 것입니다.
        하지만, 임원 코칭에 투자하는 더 구체적인 혜택이 있습니다.
        <br />
        <br />
        한 고용연구소는 (IES) 직원들에게 임원 코칭을 도입하는 조직들에게서 5가지
        주요 동기를 알아냈습니다.
        <br />
        <br />
        <ul>
          <li> 상급자를 더 높은 상급자나 다른 직무로의 임명 하기위해</li>
          <li>
            {" "}
            “높은 잠재력”을 지니고 있는 직원들의 개개인의 개인적 발전을
            가속화하기 위해
          </li>
          <li> 부서와 부서원 개개인을 지원하여 조직의 변화를 실행하기 위해</li>
          <li> 고위급 임원에게 의지가 되는 독립적인 자문역을 만들기 위해 </li>
          <li>
            {" "}
            360도 다면평가 또는 개발센터와 같은 보다 광범위한 개인 효율성
            프로그램에 참여하고 있는 고위급 임원들을 지원하기 위해
          </li>
        </ul>
      </Subtitle>
      <Subheading>임원코치를 통해 할 수 있는 것은 무엇인가</Subheading>
      <Subtitle>
        회사 내 승진이든 외부에서의 승진이든 새로운 역할을 맡는 것은 어려울 수
        있습니다. 설령 본인이 맡고 있는 일에 있어서는 여러 측면에서의 경험이
        있다고 해도, 새로운 책임은 버거울 수도 있습니다. 특히, 본인이 갓 임원이
        되거나 고위 임원의 위치에 있으면 더 그렇습니다. 해야 할 업무량이 많기에,
        여러분은 이전처럼 자신의 기술을 발전시키기 위해 훈련하고 발전시켰던
        시간들의 일부를 잃어버릴 수 도 있습니다.
        <br />
        <br />
        임원 코칭은 여러분에게 비밀스러운 ‘사고 공간 (thinking space)을 제공해
        드립니다. 여러분의 근심, 걱정, 꿈과 목표에 대해 말할 수 있는 시간과
        경청을 드리는 시간입니다. 코치께서는 여러분이 맞닥뜨리고 있는 문제들을
        해결하기 위해 현재 자원을 동원하고, 여러분의 목표를 성취하기 위해 취해야
        할 단계들을 알게 도와드릴 것입니다.
        <br />
        <br />
        임원 코치들은 여러분을 진심으로 지지하겠지만, 반면 여러분께 도전하고도
        싶어합니다. 이는 치료 또는 상담 수업이 아니며 당신을 자극하기 위해
        코치들이 있는 것이기 때문입니다. 물론, 지나친 지지는 여러분을 현재에
        안주하도록 하기에 해롭지만, 반면 너무 많은 도전은 스트레스를 줄 수
        있습니다. 임원 코치들은 지지와 도전사이의 적당한 균형을 맞춰, 최상의
        실적/성과를 이룰 수 있도록 도와드릴 것입니다.
      </Subtitle>
      <Subheading>일반적인 임원 코칭 과정은 어떤 형태인가요?</Subheading>
      <Subtitle>
        일반적으로 코칭은 일련의 단계들을 포함하고 있지만, 임원 코칭에는 많은
        변형된 형태가 있습니다. 과정은 보통 받아들임, 평가하기, 목표 설정과
        발전계획 세우기로 부터 시작하여 직원 관리자와 정기미팅 및 체크인을 통해
        발전계획을 진행합니다.
        <br />
        <br />
        임원 코칭은 비언어적인 의사소통도 필요하지만 서로의 관계 형성을 돕기에
        보통 대면으로 이루어지는 것이 이상적입니다. 그러나, 시간이 흐르면서
        소셜미디어의 세계가 점점 확장됨에 따라, 온라인 혹은 “가상 코칭”이 더
        흔해지고 있는 것인 일반적입니다.
        <br />
        <br />
        일반적으로 임원 코칭은 7-12개월 사이 동안 지속되지만, 대상에 따라 달라질
        수 있습니다. 일정은 보통 발전 목표들이 달성되면 종료되며, 코치나 고객이
        종료할 준비가 되었다고 결정한 경우에도 종료될 수 있습니다.
      </Subtitle>
      <Subheading>다음 단계</Subheading>
      <Subtitle>
        그렇다면 여러분 또는 여러분의 조직을 도울 수 있는 임원 코치는 어떻게
        찾아야 할까요?
        <br />
        <br />
        임원 코치를 찾는 방법들은 많이 있습니다. 여러분의 회사는 이미 많은
        코치들과 일을 하거나, 입소문을 통해 연락처를 찾아낼 수도 있습니다.
        개개인의 코치들은 우리처럼 명부에 등재되어 있거나 전문 기관의 일원일
        수도 있습니다.
        <br />
        <br />
        어느 누구와 마찬가지로 임원 코칭을 선택할 때, 여러분들께서는 코치분들이
        그 일을 잘할 수 있도록 믿는 신뢰가 중요합니다. ‘케미’가 중요합니다.
        이에, 인터뷰 방식의 대화나 상담방식은 코치들의 일하는 방식에 대해 더 알
        수 있는 좋은 방법입니다.
        <br />
        <br />
        질문을 하고 코치들을 고용함으로써 여러분이 얻고 싶은 것은 무엇인지
        상의해 보세요. 임원 코칭은 흔히 투자로 여겨지지만, 가치 있는 일이 되기
        위해서는 적절한 사람을 찾는 것이 중요합니다.
      </Subtitle>
    </>
  );
};

export default TextFormatExec;
