import React from "react";

import {
  Heading,
  Subheading,
  Subtitle,
  TopLine,
  UnderlineHeading,
  IndentSubtitle,
  IndentUnderlineHeading,
  Poem,
  CenterSubtitle,
  MiniText,
  BoldHeading,
  BoldList,
  HighlightedText,
} from "./InfoElements";

const TextFormatStaff = ({}) => {
  return (
    <>
      <TopLine>Staff Coaching</TopLine>
      <Heading>직원 코칭</Heading>
      <Subtitle>
        직원들은 어느 사업에 든 심장과 같습니다. 한 명의 직원이 있던 100명의
        직원들이 있던 직원들이 같은 마음을 가지고 비즈니스 가치에 연결되어
        공통의 목표에 전념하는 것에 우선시 되어야 합니다.
        <br />
        <br />
        동시에, 모든 직원들은 독특하고 개성이 있습니다. 우리는 모두 다른 장점과
        능력들을 가지고 있으며, 일부 직원들은 자신 뿐만 아니라 비즈니스를
        발전시키기 위해 도움의 손길이 필요로 합니다.
        <br />
        <br />
        여기서 코칭이 어떻게 여러분의 비즈니스에 적합할지 알아보고 코칭과
        멘토링의 차이점을 이해하면서 직원들이 개인적으로 발전할 수 있도록 돕는
        데 직원 코칭이 어떻게 이용되는지 살펴봅니다.
      </Subtitle>
      <Subheading>직원 코칭이 무엇인가요?</Subheading>
      <Subtitle>
        직원 코칭의 핵심으로 들어가기 전에 코칭 자체가 무엇인지
        설명해드리겠습니다. 코칭의 목표는 누군가를 변화시키거나 특정한 목표를
        달성하기 위해 도움을 드리는 것입니다. 이는 질문하기, 듣기, 재구성 해보기
        같은 대화 기술들을 사용하여 행해집니다. 대화는 코치가 무엇을 해야 하는지
        말해 주는 것 보다는 보통 코칭 받는 사람이 스스로 답을 알아내도록 돕는
        것에 맞춰져 있습니다
        <br />
        <br />
        코칭은 건강, 체력, 개인적인 발전과 경력과 비즈니스를 포함하여 많은 다른
        분야에서 이용되고 있습니다. 직원 코칭은 코치가 직원의 특정 기술들을
        학습하거나 향상시키는 데에 도움을 주는 것으로 종종 정해진 목표를 향해
        노력합니다. 이러한 접근 방식은 직원에게 새로운 기술을 가르치거나, 특정
        분야에서 직원의 성과를 향상시키거나 대인관계, 자신감, 필요한 기술 습득을
        하기위해 사용되곤 합니다.
        <br />
        <br />
        코칭 관계가 시작될 때, 목표는 보통 직원의 상사로부터 지원을 받아
        정해집니다. 직원과 코치는 정기 세션을 대면미팅 또는 원격으로 진행하며,
        목표 달성을 위한 실행방안을 수립합니다. 코치들은 직원에게 명확한 체계를
        제공하며, 지원과 의무 또한 제공합니다. 직원들이 배운 것을 직장에서
        실행에 옮김으로써, 종종 빠른 성과를 보일 수 있습니다.
        <br />
        <br />
        직원 코칭이 주로 커리어와 사업 비즈니스 발전에 염두에 두고 실행되지만,
        배운 기술능력들이 주로 다른 분야에도 적용되기도 합니다.
      </Subtitle>
      <Subheading>코칭은 우리 비즈니스에 있어 옳은 접근법일까요?</Subheading>
      <Subtitle>
        직원 코칭의 혜택을 이해하는 것은 여러분과 직원들이 옳은 선택이 될지
        결정하는데 좋은 시작점이 될 것입니다. 여기에 직원 코칭이 제공하는 몇
        가지 핵심 이점들을 알아보도록 하겠습니다.
      </Subtitle>
      <br />
      <IndentUnderlineHeading>
        의사소통 기술, 갈등관리, 관계 구축 향상에 도움
      </IndentUnderlineHeading>
      <IndentSubtitle>
        의사소통은 직장 내부와 외부 모두에 필요하며 비즈니스에 필수적인
        요소입니다. 의사소통, 갈등이나 관계형성에 문제가 있어 보이는 직원에게는
        코칭이 이러한 분야의 기술들을 습득하게 하는데 도움이 될 것입니다. 특히
        이러한 지원 혜택을 받고 싶어하는 직원이 있거나 그룹 코칭에 대해
        알아보기를 원할 수도 있습니다.
      </IndentSubtitle>
      <br />
      <IndentUnderlineHeading>
        조직 관리 및 시간 관리 기술 증진
      </IndentUnderlineHeading>
      <IndentSubtitle>
        체계적인 것은 우리 모두에게 자연스럽게 주어지는 것은 아닙니다. 새로운
        테크닉 들을 배우고, 업무를 체계화하는 방법을 찾는 것은 이러한 업무
        측면에서 어려움을 겪고 있는 직원들에게 도움이 될 수 있습니다.
      </IndentSubtitle>
      <br />
      <IndentUnderlineHeading>
        기존에 가지고 있는 재능 격려하기
      </IndentUnderlineHeading>
      <IndentSubtitle>
        보통 직원들이 가지고 있지 않는 능력들을 강조하지만, 기존의 재능을 더
        양성하는 곳도 있습니다. 직원들이 현실에 안주하지 않고, 기술을 연마하고
        진정한 잠재력을 발휘할 수 있도록 도와드리고 있습니다.
      </IndentSubtitle>
      <br />
      <IndentUnderlineHeading>자신감 키우기</IndentUnderlineHeading>
      <IndentSubtitle>
        자기 의심이 많은 사람들을 망설이게 합니다. 이는 우리가 종종 접하는
        일이며, 만약 여러분의 자신감 부족이 직원의 발전을 가로 막았다고
        생각된다면, 이는 코치가 도와드릴 수 있는 문제입니다. 코치들은 직원들이
        편안하게 안주하는 곳에서 벗어나 천천히 자신감을 쌓을 수 있도록
        격려하면서 직원들의 능력을 보고 두려움을 이겨내 성공할 수 있도록
        도와드릴 것입니다.
      </IndentSubtitle>
      <br />
      <IndentUnderlineHeading>
        프레젠테이션 및 대중 연설 능력 향상
      </IndentUnderlineHeading>
      <IndentSubtitle>
        몇몇 역할은 프레젠테이션과 대중 앞에서 연설을 잘 할 수 있는 능력을
        요합니다. 이러한 것들은 일정 시간 동안의 경험들이 필요로 하지만, 직원이
        누군가의 지원을 받고 학습 속도를 높이기를 원한다면, 이러한 전문지식을
        가진 코치를 고용하길 원할 것입니다. 코치들은 직원에게서 실력향상에
        방해가 되는 장애물들을 발견하고 두려움을 관리하면서 프레젠테이션을 할 때
        자신감을 가지고 더 연습하도록 적극 지원해 드립니다.
      </IndentSubtitle>
      <br />
      <IndentUnderlineHeading>
        새로운 사고방식에 영감을 주고 창의력 증진
      </IndentUnderlineHeading>
      <IndentSubtitle>
        특히 직원들이 오랫동안 회사에서 똑 같은 일을 반복해서 하고 있어왔다면
        틀에 박힌 사고를 하기 쉬울 것입니다. 코치를 고용하면 직원들이 창의력과
        독창적인 사고를 위한 기술들을 공유하며, 새롭고 다양한 각도에서 사고해 볼
        수 있게 도움을 드립니다.
      </IndentSubtitle>
      <br />
      <IndentUnderlineHeading>
        업무량 관리, 경계 설정과 번아웃 방지에 대한 지원
      </IndentUnderlineHeading>
      <IndentSubtitle>
        직장 스트레스와 번아웃은 여러 산업군에서 큰 관심사입니다. 회사 차원에서
        팀을 도와 줄 수 있는 여러 방법들이 있을 수도 있겠지만 일부 직원들은
        코칭을 통해 보다 집중된 관심을 받으며 해결 할 수 있습니다. 이러한 분야를
        지원하는 코치는 직원들이 기대치를 설정하고 관리하며, 적당한 경계선을
        설정하여 일과 삶의 균형을 향상시킬 수 있도록 도와줍니다.
      </IndentSubtitle>
      <br />
      <IndentUnderlineHeading>
        학습과 자아 성찰을 위한 안전하고 판단에서 자유로운 공간 제공
      </IndentUnderlineHeading>
      <IndentSubtitle>
        업무는 절대 끝나지 않으며 점심시간을 놓치면서까지 엄청나게 빠른 속도로
        진행됩니다. 코칭은 직원들에게 잠시 멈추고, 곰곰이 생각하고, 배울 수 있는
        전용 공간과 시간을 제공해 드립니다. 코칭 시간은 이미 발생한 문제들과
        이러한 문제들을 처리할 수 있는 방법을 논의하는 데에 사용될 것 입니다.
      </IndentSubtitle>
      <Subtitle>
        이러한 것들은 고려해 볼 수 있는 몇 가지 예시들일 뿐입니다. 여러분의
        직원이 코치의 말에 공감하고 신뢰하도록 하는 것 또한 중요합니다. 만약
        여러분의 직원들이 단순히 승진을 위해 채워야 하는 요식행위가 아니라
        코칭이 어떻게 자신들을 발전시키는지 이해하고 이에 대해 즐거워한다면
        결과는 훨씬 더 긍정적일 것입니다.
        <br />
        <br />
        많은 직원들은 코치가 제공하는 지지에 대해 감사하고 즐거워하지만, 모든
        사람에게 올바른 접근법은 아니라는 것을 유념해야 합니다. 직원이 코칭에
        대한 생각이 긍정적이지 않다고 생각된다면, 다른 방법을 모색할 수
        있습니다. 외부 교육, 온라인 학습이나 멘토링이 여러분 환경에서는 더
        적합하게 느껴질 수도 있습니다.
      </Subtitle>

      <Subheading>코칭과 멘토링의 차이점은 무엇인가요?</Subheading>
      <Subtitle>
        코칭과 멘토링의 목표는 대체로 같습니다. 누군가를 변화시키고 목표를
        달성하게끔 돕는 것입니다. 과정 자체도 대화, 질의, 청취 기술을 사용하는
        동시에 책임과 지원을 제공하는 과정 자체도 유사합니다.
        <br />
        <br />
        주요 차이점은 누가 이러한 서비스를 제공하느냐 입니다. 코치들은 특별히
        교육을 받은 사람들이며, 주로 코치로써 일을 하기에 해당 사업과는 직접
        관련이 없는 사람들일 것입니다. 직장에서의 멘토링 관계는 경험이 적은
        사람과 일하게 될 사내 고위 직원들을 포함하는 경우도 있습니다.
        <br />
        <br />
        멘토들은 자신의 지식과 사업에 대한 이해를 이용하여 멘티들이 회사 발전에
        필요한 능력들을 발전할 수 있도록 도울 것입니다. 일부 멘토들은 코칭
        교육을 받지만, 이는 자주 있는 일은 아닙니다.
        <br />
        <br />
        만약 여러분께서 직원이 코칭이나 멘토링으로부터 효과를 얻을 수 있을 거라
        생각한다면, 직원이 어떤 결과를 얻기를 바라며, 필요한 지원 수준은 어떤 지
        고려해보세요. 외부인의 지원을 받아 좀 더 체계적인 접근 방식을 통한
        효과를 얻고자 하는 사람들은 코치와 함께 일하는 것이 더 적합할 수 있는
        반면, 회사내의 통찰력을 가진 사람에게 지원보다는 가이드를 얻고 싶어하는
        사람들에게는 멘토와 협력하는 것이 더 나을 수 있습니다.
        <br />
        <br />
        또한 여러분의 직원에게 어떤 접근방식 가장 적합하다고 생각하는지 물어볼
        수 있습니다. 일부 사람들은 직장내에서 누군가와 친근감을 가지고 일하기를
        좋아하는 반면, 어떤 사람들은 코칭이 줄 수 있는 일정한 거리감을 선호할 수
        있습니다.
      </Subtitle>
    </>
  );
};

export default TextFormatStaff;
