import React from "react";

import { Heading, Subheading, Subtitle, TopLine } from "./InfoElements";

const TextFormatStaff = ({}) => {
  return (
    <>
      <TopLine>커리어 코칭</TopLine>
      <Heading>커리어 코칭이란?</Heading>
      <Subtitle>
        커리어 코칭은 개인의 적성에 맞는 일을 찾을 수 있게 조언하고 여러분의
        능력과 강점을 상세히 파악하여 더 나은 <br />
        진로변경을 할 수 있도록 목표를 정하고 실천하도록 돕는 과정을 말합니다.
        <br />
        <br />
        코치는 여러분에게 무엇을 해야 하는지에 대해 말해주지는 않지만 현재
        여러분의 상황과 목표에 대한 충분한 이해와 컨설팅 후 결정을 내릴 수
        있도록 지원하며 조직의 핵심인재로 성장할 수 있도록 도와주는 ‘인생의
        조언자’의 역할을 할 것 입니다.
      </Subtitle>
      <Heading>커리어 코칭을 통해 어떤 도움을 받을 수 있나요?</Heading>
      <Subtitle>
        커리어 코칭을 통해 얻을 수 있는 혜택은 여러 측면에서 다양하게 있으며
        이는 전적으로 여러분에게 달려 있습니다. 코치와 아래 주제들에 대해 코칭을
        받으실 수 있으며 이외 여러분이 원하시는 주제들도 직접 정하실 수
        있습니다. <br />
        <br />
        <ul>
          <li>현 직장에서의 경력 향상</li>
          <li>경력관리에 대한 이해와 그에 따른 선택사항들 검토</li>
          <li>잠재적인 장애물들을 진단해보고 극복하기</li>
          <li>본인의 능력과 경험을 활용하고 향상시키기</li>
          <li>다른 지원자들로부터 돋보이기 위한 인터뷰 코칭</li>
          <li>돋보이는 이력서 작성을 위한 지원</li>
          <li>진로 변경을 위한 지원 및 도움</li>
          <li>직장생활에서 도태되어 있는 감정으로부터 극복하기</li>
          <li>다가올 기회를 위해 자신의 위치 설정하기</li>
          <li>달성가능한 목표 및 실행 계획 수립</li>
          <li>일과 가정 사이의 균형 재조정 및 우선순위 관리</li>
          <li>장기 휴직 또는 병가 후 직장으로의 복귀</li>
        </ul>
        <br />
        커리어 코칭을 받기 위해 직장을 다니고 있어야 하는 것은 아닙니다.
        여러분은 어쩌면 오랜 기간 교육을 받은 후, 어느 <br />
        방향으로 나아가야 할지 모르는 대학 중퇴자나 졸업생 일 수도 있습니다.
        특정 전공에 몰두하느라 수년간의 시간을 <br />
        보냈지만 그것이 더 이상 자신이 추구하지 않는 방향이라는 것을 늦게 깨닫게
        될 수도 있습니다.
        <br />
        <br />
        무엇을 진정으로 원하는지 몰라도 괜찮습니다, 지극히 정상적인 일입니다.
        그럼에도 불구하고 선택할 수 여지가 있다는 <br /> 것을 잊지 말아야
        합니다. 커리어 코칭은 여러분이 가지고 있는 능력을 인지하고, 어떤 직업에
        관심이 있고, 또한 이러한 <br /> 목표를 달성하는데 도움을 드릴 수
        있습니다.
      </Subtitle>
      <Heading>커리어 코치와 상의하기</Heading>
      <Subtitle>
        여러분은 본인이 무엇을 원하는지 알고 있지만, 원하는 목표에 어떻게
        도달하는지 모를 수 있습니다. 우리가 원하는 직업을 가질 수 있는 유일한
        방법은 수년간의 경험과 훈련 그리고 교육을 통해서만 얻을 수 있다고
        생각합니다. 하지만 반드시 <br />
        그러한 것은 아닙니다. 때로는 우리를 망설이게 하는 것은 나이, 교육 또는
        경험의 정도가 아닌 우리 자신에 대한 불신일
        <br />
        때가 있습니다.
      </Subtitle>
      <Subheading>준비가 되셨나요?</Subheading>
      <Subtitle>
        우리는 중요한 결정을 내릴 때 아직 준비가 되어 있지 않다고 생각하며
        스스로를 망설이게 합니다. 과거 직장상사들 <br />
        대부분은 누군가를 코칭 할 수 있는 시기는 오로지 나이가 들아 풍부한
        인생경험을 가지고 연륜이 쌓였을 때나 가능하다고 <br /> 생각했지만 지금은
        그렇지 않습니다.
        <br />
        <br />
        “여러분이 스스로의 삶을 책임 진다면 이 순간이 설령 두려울지라도 여러분
        자신과 능력을 믿으세요! 그러면 그 결과와 <br />
        경험은 적절한 시기를 기다리는 것 보다 훨씬 더 많은 이점을 가지고 올
        것입니다.”
      </Subtitle>
      <Heading>커리어 코칭을 통해 기대할 수 있는 것</Heading>
      <Subtitle>
        앞서 언급한 바와 같이, 커리어 코칭은 당신이 어떻게 해야 하는지 답을
        직접적으로 알려 드리진 않지만, 여러분이 어떻게 <br /> 느끼고 무엇을
        원하는지 이해할 수 있도록 적극적으로 도울 것이며, 그 과정내내 여러분과
        함께 하며 지지해 드릴 것 입니다. <br />
        <br />
        당신은 현재 역할 또는 직무에 만족하지 못하여 지금의 익숙함에서 벗어나고
        싶다고 느끼지만 아직 뭔가 결정하기는 어려울 수 있습니다. 그 동안의
        커리어를 바꾼다는 것이 무책임하다고 생각될지도 모릅니다. 만약 잘못된
        선택이면 어쩌지? 그러나 더 중요한 것은 당신의 일이 현재의 당신에게
        행복감을 주지 않는다면 스스로에게 더 의미 있고 성취감을 가져다 줄 기회를
        잃게 되는 일이 되고 마는 것입니다. <br />
        <br />
        커리어 코치들은 경청의 전문가들입니다. 이들은 당신의 이야기를 경청할
        것이며, 여러분과 함께 현 상황을 면밀히 파악하고 여러분의 감정 또한
        이해하려고 할 것입니다. 스스로 해결하기에는 매우 어려운 일이지만 종종
        친구나 가족들에게 털어 놓음으로써 해결되는 경우도 있습니다. 그러나
        때때로는 전문가의 도움이 필요로 합니다. <br />
        <br />
        코칭 수업에서 받는 조언은 여러분과 여러분의 상황, 감정, 요구와 필요에
        따라 완전히 달라집니다. 코치는 여러분들이 현재 놓여진 직무 뿐만 아니라
        전반적인 삶에 대한 이러한 감정들을 파악하도록 도와드릴 것입니다.
        <br />
        <br />
        우리는 살아가면서 우리의 삶이 일에 미치는 영향에 대해 잊어버리곤 합니다.
        반대로, 우리의 삶에서 무슨 일이 벌어지고 있는지 이해하는 것도 간과되고
        있어서, 특정 스트레스 요인들을 어떻게 관리해야 하는지도 매우 중요합니다.
        우리의 기분에 영향을 주는 더 큰 무언가가 있을 수도 있습니다. 실제로는
        우리의 일에는 아무 문제가 없을지 모르지만, 우리의 행복에 영향을 주는
        것은 가정이나 사회생활일 수도 있습니다.
        <br />
        <br />
        직장과 삶의 균형을 이룰 수 있는 몇 가지 조언을 공유합니다.
        <br />
        <br />
        어떤 일이 당신을 정말로 즐겁게 하는지 모르겠다면, 여러분의 열정과 강점에
        맞는 일을 찾아보고 조사하는 데에 시간을 가질 필요가 있습니다. 어렸을 때
        무엇을 좋아했나요? 특별히 즐겼던 취미나 재주가 있었나요?
        <br />
        <br />
        여러분이 열정을 가지고 일할 수 있는 직무나 산업군을 찾았다면, 이제는
        원하는 지점에 도달하기 위해 가져야 할 능력과 단계를 이해해야 할
        시점입니다. 주변사람들에게 당신의 강점과 약점을 물어보세요. 당신에 대해
        어떻게 말할 것인지 물어보고, 당신은 스스로에 대해 어떻게 말할 것인지도
        생각해보세요.
        <br />
        <br />
        그리고나서 알아낸 모든 것을 적어보고, 작성한 것들을 코칭 수업에 가져가
        보세요. 코치는 여러분이 개선시켜야 할 분야, 보유하고 있는 능력과 추가
        교육이 필요한 분야를 함께 파악할 것입니다. 그리고 나서 함께 실행 계획을
        세우고 목표를 향해 일을 시작할 수 있게끔 도와 줄 것입니다.
        <br />
        <br />
      </Subtitle>
      <Heading>커리어 코칭 과정</Heading>
      <Subtitle>
        코칭 과정 수행 방법은 본인과 코치가 결정하게 됩니다. 몇몇 상담은 전화나
        온라인으로 이루어지는 반면 대면 상담으로 제공되기도 합니다. 코칭 기간은
        개인의 필요에 따라 정해집니다. 1회 또는 2회로 충분할수도 있고 어쩌면
        10번의 과정이 필요할 수도 있습니다. 코칭 과정이 끝나는 시점에서 본인
        또는 코치가 추가의 코칭이 필요하다고 판단이 된다면 상의해서 정할 수
        있습니다.
        <br />
        <br />첫 상담은 여러분이 무엇을 도움 받기를 희망하는지, 고민이나 궁금한
        점이 있는지에 대해 상담하게 될 것입니다. 이는 서로를 알아가는 시간이자
        진로 컨설팅과 수업에서 기대하는 것에 대해 좀 더 이해하는 시간입니다.
        수업의 내용과 방향은 여러분의 상황과 경험에서 얻고자 하는 바에 따라 크게
        달라질 것이며, 여러분이 다루게 될 몇 가지 주제는 아래와 같습니다.
      </Subtitle>
      <Subheading>자신의 능력 탐색 및 성과 파악하기</Subheading>
      <Subtitle>
        여러분들은 자신이 깨닫지 못하는 많은 능력과 자질을 가지고 있습니다.
        여러분이 어떤 것에 대해 잘하지 못한다고 생각하는 반면 남들이 볼 땐
        잘한다고 생각할 수 있습니다. 잠재적인 고용주에게 인상적으로 보일 수 있는
        많은 기술들을 우리가 생각하였을 때 부족하다고 느끼지만, 사실상 우리가
        생각하는 것보다 더 많은 능력을 가지고 있다는 것입니다. 이는 단지
        여러분들이 볼 수 없을 뿐입니다. 커리어 코치는 이러한 기술과 자질을
        파악하는데 능숙한 전문가이며, 이를 스스로 인지할 수 있도록 도와드릴 것
        입니다.
      </Subtitle>
      <Subheading>이상적인 직업 선택</Subheading>
      <Subtitle>
        우리는 사는데 너무 정신없어 진짜 원하는 것이 무엇인지 생각해볼 여유도
        없는 채로 일하고, 퇴근하고, 먹고, 쉬고 다시 일을 합니다. 비욘세, 버락
        오바마, 또는 당신에게 영감을 주는 사람들은 주어진 시간도 같고 더 바쁜
        와중에도 어떻게 성공할 수 있었을까요?
        <br />
        <br />
        커리어 코칭은 이러한 의미 있는 시간들을 찾도록 도움을 드릴 뿐만 아니라
        여러분의 직업으로부터 원하는 것을 알아내기 위해 함께 할 것입니다.
        여러분의 열정은 무엇이고 행복하게 만드는 것은 무엇인가요? 이러한 시간을
        통하여 새로운 가능성들을 탐구할 수 있는 기회를 갖게 될 것입니다.
      </Subtitle>
      <Subheading>커리어를 바꾸는 것은 옳은 선택일까요?</Subheading>
      <Subtitle>
        여러분들의 행복에 영향을 주는 많은 요소들이 있습니다. 여러분이
        불행하다고 생각하는 것이 진짜 불행의 요소가 아닐 수 있지만, 일은 아마도
        쉬운 대답일 수 있습니다. 코치는 당신의 일과 삶의 균형 (워라벨)에 대해
        평가하고 현재 직장이 문제인 것인지 아니면 다른 요소가 문제 인지를 파악할
        수 있도록 돕고 있습니다. 단순한 삶의 변화가 차이를 만들 수도 있고,
        이직보다 현 직장에서의 부서 이동이 직업과 삶의 만족도를 높이는 것이
        해답일 수도 있습니다. 비결은 자신에게 솔직해지는 것이며 자신만이
        진정으로 감정을 느끼고 행복하기 위해 무엇을 해야 하는지 알 수 있습니다.
      </Subtitle>
      <Subheading>당신을 망설이게 하는 것들 알아 차리기</Subheading>
      <Subtitle>
        직업에 변화를 주는 것은 중요한 결정이며 돈과 가족들로 인해 결정을 더
        망설이게 됩니다. 하지만 무엇이 정말 당신을 망설이게 할까요? 만약 돈이
        답이 아니라면, 결정은 쉬워지거나 또는 여전히 의구심이 들 수 있습니다.
        코칭을 통해 무엇이 여러분들을 망설이게 하는지 이해하고 두려움과 싸우고
        목표를 달성할 수 있도록 도움을 드리고 있습니다.
      </Subtitle>
      <Subheading>영문 이력서 작성 지원</Subheading>
      <Subtitle>
        어쩌면 당신의 이력서는 오래되어 업데이트하는 것이 상당히 부담이 될 수
        있습니다. 다른 지원자들로부터 어떻게 돋보일 수 있을까요? 무엇이 여러분을
        경쟁력 있는 후보로 만들까요?
        <br /> <br />
        커리어 코칭은 당신의 강점을 스스로 인지할 수 있도록 하며, 무엇이
        여러분의 존재감을 돋보이게 하는지 알아내도록 돕고 있습니다. 지원과정에
        대해 알려드리고 있으며, 이력서와 자기소개서에 여러분의 능력과 성격을
        나타낼 수 있는 방법에 대해 알려드립니다.
      </Subtitle>
      <Subheading>인터뷰 코칭과 면접에서의 차별화 전략</Subheading>
      <Subtitle>
        여러분께서는 코칭을 통해 마침내 이직결정을 내리셨고, 원하는 직장을
        찾으셨다면 이제 곧 인터뷰를 보시겠군요! 좋은 소식입니다! 하지만 여러분의
        상당수가 면접을 두려워하시는 분들이 많습니다. 짧은 시간 내에 본인을
        어필하는 것은 쉽지 않습니다. 그렇기에 담당 코치는 여러분에게 일반적인
        인터뷰 스킬과 더불어 곤란한 질문에 대처하는 법에 대해 도움을 드리고
        있습니다.
      </Subtitle>
    </>
  );
};

export default TextFormatStaff;
