import React from "react";

import {
  Heading,
  Subheading,
  Subtitle,
  TopLine,
  UnderlineHeading,
  IndentSubtitle,
  IndentUnderlineHeading,
  Poem,
  CenterSubtitle,
  MiniText,
  BoldHeading,
  BoldList,
  HighlightedText,
} from "./InfoElements";

const TextFormat = ({}) => {
  return (
    <>
      <TopLine>Mentorship</TopLine>
      <Subheading>멘토링</Subheading>
      <Subtitle>
        여러분이 현재 커리어에 갈피를 잡지 못하고 실질적인 가이드를 받기
        희망한다면, 멘토링을 하면서 도움을 얻을 수 있습니다. 여러분의 커리어를
        도와주는 멘토는 보통 당신이 일하는 산업군에서 경험을 가지고 있는
        사람입니다. 멘토는 일과 관련된 문제 해결에 도움을 주고 전문적인 성장을
        위해 여러분들을 격려하면서 올바른 방향으로 나아가게끔 지도할 것입니다.
        <br />
        <br />
        멘토링의 핵심은 멘토와 멘티 간의 관계입니다. 상호적인 믿음과 존경을
        바탕으로, 이러한 관계를 갖는 것은 여러분의 직장에서의 성공에 강력한
        영향을 줍니다. 앞으로의 내용들을 읽어가면서, 멘토링에 대해 더 알아보고
        비즈니스 멘토가 여러분의 잠재력을 충족시키는데 어떻게 도움을 줄 수
        있는지 알아보세요.
      </Subtitle>
      <Subheading>멘토링이 무엇인가요?</Subheading>
      <Subtitle>
        옥스퍼드 코칭 및 멘토링 대학의 에릭 파슬로에 따르면,
        <br />
        <br />
        <Poem>
          멘토링은 여러분들의 잠재력을 극대화하고, 능력을 개발하고, 성과를
          높이면서 본인이 되고 싶은 사람이 될 수 있도록 학습한 것들을 잘
          관리되게 하고 격려하는 것입니다.
        </Poem>
      </Subtitle>
      <Subtitle>
        비즈니스 멘토링 측면에서 이러한 정의는 직업적인 성장과 일과 관련된 기술
        개발과 연관이 있습니다. 멘토링의 전제는 멘토가 여러분들보다 더 광범위한
        전문 경험을 가지고 있어서 지원을 아끼지 않으며 여러분의 잠재력을
        최대화하기 위해 조언과 격려를 제공하는 것입니다.
        <br />
        <br />
        멘토는 여러분의 사고방식의 변화뿐만 아니라 자신감을 높이도록 도와드릴
        것입니다. 여러분께서는 자신 있게 새로운 아이디어를 논의하고 탐구하는데
        편안함을 느끼는 동시에 본인과 본인의 비즈니스의 필요한 사항을 모두
        평가할 수 있는 기회를 가질 것입니다.
      </Subtitle>
      <Subheading>멘토는 무엇을 하나요?</Subheading>
      <Subtitle>
        멘토의 역할은 여러분들이 멘토를 필요로 하는 이유에 따라 달라집니다. 몇몇
        분들은 본인들의 경력에 도움을 받기 위해 멘토를 쓰기도 하며, 이는 멘토가
        여러분의 전문성 개발을 위해 주력할 것임 의미합니다. 다른 분들께서는
        본인과 본인이 운영하는 사업에 도움을 받기 위해 멘토를 씁니다. 이러한
        경우, 멘토는 주로 여러분의 사업에 초점을 맞출 것이며, 더 발전하기 위한
        지침을 제공할 것입니다. 당신이 멘토를 고용하기로 결정한 어느 이유이던
        간에, 멘토는 자신의 역할을 수행하기 위해 다루는 주제들이 있습니다.
        <br />
        <br />
        <ul>
          <li> 새로운 능력/기술 교육</li>
          <br />
          <li> 현재 가지고 있는 능력/기술에 대한 코칭 </li>
          <br />
          <li> 재원과 네트워킹 공유를 통한 사업 성장 촉진</li>
          <br />
          <li> 익숙한 환경에서 벗어나도록 도전의식 북돋우기</li>
          <br />
          <li> 안전한 학습 환경 조성</li>
          <br />
          <li> 미래 사업전략에 대한 지침 제공</li>
          <br />
          <li> 불확실한 분야에 대한 지원 제공</li>
          <br />
        </ul>
      </Subtitle>
      <br />
      <Subheading>비즈니스 멘토링의 유형</Subheading>
      <Subtitle>
        여러분들의 필요에 따라, 이용하실 수 있는 다양한 멘토링 유형이 있습니다.
        그렇기에 하나씩 잘 살펴보고 본인에게 가장 적합한 것이 무엇인지 결정할
        것을 추천 드립니다.
      </Subtitle>
      <BoldHeading>일대일 멘토링 (One-to-one Mentoring) -</BoldHeading>
      <Subtitle>
        가장 인기있는 멘토링 유형이며 일대일 멘토링은 한 명의 멘토가 한 개인과
        함께 멘토링을 진행 하는 것입니다. 이러한 멘토링은 사적인 친분 관계를
        쌓을 수 있으며, 개인에 초점을 둔 지원과 관심을 드리기에 선호되고
        있습니다.
      </Subtitle>
      <BoldHeading>그룹 멘토링(Group mentoring) - </BoldHeading>
      <Subtitle>
        이 멘토링 유형은 본인과 본인의 동료 혹은 친구들이 같은 분야에서 멘토링을
        받고자 한다면 도움이 될 수 있습니다. 당신이 당신의 친구들과 함께 개인
        사업을 시작할 계획이거나 또는 업계나 산업에서 비슷한 생각을 가지고 있을
        수도 있습니다. 어느 쪽이든, 그룹 멘토링은 배움의 환경 속으로 여러분과
        함께 할 것입니다.
      </Subtitle>
      <BoldHeading>교육기반의 멘토링(Training-based mentoring) - </BoldHeading>
      <Subtitle>
        교육기반 멘토링 유형은 특정 교육 프로그램과 직접적으로 연결되어 있는
        멘토링입니다. 종종 회사는 직원 교육을 돕기 위해 외부에서 멘토링을 위탁할
        것입니다. 이러한 유형의 멘토링은 한가지 특정 학습 영역에만 관련이 있기
        때문에 멘토링이 제한적일수 있습니다.
      </Subtitle>
      <Subheading>기타 멘토링 유형</Subheading>
      <HighlightedText>
        멘토링 유형 내에 또 다른 인기있는 서비스는 “멘토링과 친구되기” 입니다.
      </HighlightedText>
      <Subtitle>
        비즈니스 환경 이외에서 사용되는 이러한 유형의 멘토링은 개인과 그룹이
        개인적인 잠재력을 충족시킬 수 있도록 도와주며, 그들의 삶에서 최대한
        활용할 수 있게끔 도와드립니다. 멘토링과 친구되기는 다음과 같은
        집단군에서 많이 사용됩니다.
      </Subtitle>
      <HighlightedText>
        청년(청소년)- 몇몇 청년들은 신뢰할 수 있는 지원시스템이 부족하기에
        멘토를 통해 혜택을 얻을 수 있습니다. 이러한 관계에서 멘토는 어느정도
        롤모델이 되거나 또는 친구가 되는 것을 목표로 합니다. 청년들이 삶의 모든
        영역에서 동기부여를 느낄 수 있게 돕는 것은 멘토에게 매우 중요할 뿐만
        아니라 청년들에게 문제가 발생했을 때 대화를 나눌 수 있는 객관적인 사람이
        되어주는 것도 중요합니다.
      </HighlightedText>
      <br />
      <br />
      <HighlightedText>
        범죄자- 범죄자들이 출소한 후 , 종종 이전의 생활패턴으로 다시 돌아가며,
        대부분이 재범을 저지릅니다. 멘토들은 이러한 기간동안 지원을 드리며,
        범죄자들이 취업을 하고 사회와 다시 연결될 수 있도록 돕는 것을 목표로
        하고 있습니다.
      </HighlightedText>
      <br />
      <br />
      <HighlightedText>
        노인- 노인과 친구가 되는 것은 외로울 수도 있는 사람들에게 우정을 드리는
        것입니다. 멘토들은 이러한 환경에서 노인들에게 친구가 되어주며, 주변에
        다른 사람이 없을 때 의지하고 대화할 수 있는 사람이 되어주는 것입니다.
      </HighlightedText>
      <Subheading>코칭과 멘토링의 차이점은 무엇인가요?</Subheading>
      <Subtitle>
        종종 “멘토” 와 “코치” 라는 용어는 서로 교차되어 사용되곤 합니다. 그러나
        특히 비즈니스 분야에서는 이 두 용어 간의 미묘한 차이점들이 있습니다.
        핵심적인 차이점은 코칭은 기능 중심인 반면, 멘토링은 관계에 중심을 두고
        있습니다.
        <br />
        <br />
        기타 이 외에 차이점들은 다음과 같습니다.
        <br />
        <ul>
          <li>
            코칭은 보통 단기적입니다. 비즈니스 코치는 여러분이 원하는 결과를
            얻을 때까지 단기적인 기간동안 함께합니다.
          </li>
          <br />
          <li>
            멘토링은 보통 더 장기적입니다. 멘토는 여러분의 발전을 진전시키기
            위해 비교적 긴 시간동안 함께 할 것입니다. 이는 9개월에서 일년 또는
            그 이상의 시간이 될 수도 있습니다.
          </li>
          <br />
          <li>
            코칭은 성과 중심적인 경향이 있습니다. 비즈니스 코칭의 목적은 대게
            특정 직무 역할내에서 본인의 성과를 향상시키는 것입니다. 이는 능력을
            강화하고 새로운 것들을 발전시키는 것을 포함합니다.
          </li>
          <br />
          <li>
            멘토링은 보다 자기 개발 중심적입니다. 이는 멘토가 현재와 미래 를
            위해 여러분과 여러분의 비지니스를 발전시키려고 할 것임을 의미합니다.
          </li>
        </ul>
      </Subtitle>
      <Subheading>멘토가 어떤 도움을 줄 수 있나요?</Subheading>
      <Subtitle>
        각각의 멘토는 전문분야를 가지고 있으며, 당신이 필요로하는 멘토를 찾는
        것이 중요합니다. 예를 들어, 여러분께서 새로운 잡지를 출간한다면,
        여러분께서는 잡지 및 출판업에 경험이 있는 멘토로부터 혜택을 받을 수
        있습니다. 마찬가지로, 여러분의 사업이 그다지 효율적이지 않다면, 효율성에
        능한 멘토에게 도움을 구하는 것이 유용할 것입니다.
        <br />
        <br />
        비즈니스 멘토가 도움을 드릴 수 있는 다양한 분야가 있으며, 이는 다음을
        포함합니다.
      </Subtitle>
      <Subheading>비지니스 검토</Subheading>
      <Subtitle>
        멘토가 여러분의 사업을 발전시키고 성장시키는데 도움을 주고자 한다면,
        첫번째로 멘토가 할 일은 비지니스 검토일 것입니다. 이는 사업이 잘
        수행되고 있는 지와 개선점이 있는지를 확인하기 위해 비즈니스의 모든 면을
        조사하는 것을 포함합니다. 여러분 사업의 흠을 찾아 지적하는 것이 아닌
        발전을 위한 가능성 있는 분야에 대한 통찰력을 제공해야 하는 것입니다.
        <br />
        <br />
        우리가 매일 같은 환경에 있을 때는 나무들만 보고 숲을 보기 어려울 수
        있습니다. 그렇기에 신선한 안목이 도움이 되곤 합니다. 비즈니스 멘토는
        여러분이 이전에는 고려하지 못했던 것들을 알아차리고 하고 사물을 보는
        방식에 도전의식을 가질 수 있도록 합니다.
      </Subtitle>
      <Subheading>직원 채용</Subheading>
      <Subtitle>
        적절한 인재를 채용하기 어렵거나 채용에 관해 공정한 충고가 필요할 때,
        비즈니스 멘토가 이를 도와드리고 있습니다. 멘토의 공통적인 특징은
        팀원들과 일하는 것에 대해 많이 알고 있다는 것입니다. 이는 멘토가 어떤
        유형의 사람이 이 비즈니스에 적합한지, 채용과정에서 적합한 인재를
        선택하는 방법에 대해 잘 알고 있다는 것을 의미합니다.
        <br />
        <br />
        멘토는 최고의 채용공고 작성부터 면접 절차까지 채용과정 자체에 대해서도
        조언을 제공드릴 수 있습니다. 마지막에 결정을 내리는 것이 멘토의 책임이
        아닐지라도, 여러분의 결정에 도움이 되는 지침을 제공할 수 있습니다.
      </Subtitle>
      <Subheading>인재 유지</Subheading>
      <Subtitle>
        적합한 인재를 찾으셨다면, 여러분은 그 인재들을 계속 회사에 머무르게
        만들고 싶어 할 것입니다. 직원 유지는 성공적인 비즈니스의 핵심 요소이며,
        이는 멘토들이 도움을 줄 수 있는 영역입니다. 멘토는 여러분이 긍정적이고
        소통중심의 근무 환경을 만들 수 있도록 도우면서, 팀 구성 아이디어와
        논쟁이 되고 있는 분야를 개선하기 위한 방법을 제안할 수 있습니다.
        <br />
        <br />
        사람을 관리하는 것은 사업을 운영하는데 있어서 가장 어려운 부분이기에
        사람을 다루는 기술을 가진 멘토가 매우 유용할 수 있습니다. 그러나
        궁극적으로 여러분은 여러분의 직원이 최고라는 것을 알아야 하고, 협력하기
        위해 노력하는 것이 중요합니다.
      </Subtitle>
      <Subheading>일에 필요한 전문성 개발</Subheading>
      <Subtitle>
        여러분이 스스로를 전문적으로 발전시키고 싶거나, 여러분을 위해 일하는
        사람들의 경력을 발전시키는 것을 돕고 싶다면 이는 전문성 개발을 진행하는
        비즈니스 멘토에게 핵심적인 특권입니다. 미래에 대한 여러분의 생각을
        멘토와 의논하는 것은 중요하며, 이는 멘토가 여러분을 가장 잘 도와줄 수
        있는 방법을 찾을 수 있게 합니다. 보통 멘토는 본인들의 경험을 바탕으로
        조언을 드리며, 여러분의 능력 또는 기술을 실천하기 위한 실행계획을 세우기
        위해 여러분과 함께 할 것입니다.
      </Subtitle>
      <Subheading>사업영역 확장</Subheading>
      <Subtitle>
        여러분의 사업이 성장 측면에서 난관에 봉착했다면, 외부에서 도움을
        요청하는 것이 유용할 수도 있습니다. 사업이나 기업을 발전시키고
        성장시키는데 경험이 있는 멘토는 여러분의 일하는 방식을 검토하고 사업을
        성장시키기 위해 개선할 수 있는 방안을 모색할 것입니다.
        <br />
        <br />
        혹은 여러분께서 빠르게 성장하는 사업을 운영 할 수도 있지만, 어떻게
        대처해야 할 지 다소 확신이 서지 않을 수 있습니다. 비즈니스 멘토는
        여러분의 사업을 최대한 활용할 수 있는 방법을 수립하면서 미래에 대한
        계획을 세우는데 도움을 드리고 지원할 것입니다.
      </Subtitle>
      <Subheading>멘토 고용의 장점들</Subheading>
      <Subtitle>
        비즈니스 멘토를 고용하는 것은 본인 자신과 본인이 운영하는 사업에서
        예상치 못한 부분에도 많은 잠점들을 가져다 줄 수 있습니다. 다음 목록에서
        몇 가지 예시들을 살펴봅시다.
        <br />
        <br />
        <ol>
          <li>
            <BoldList>실질적인 조언을 얻을 수 있습니다</BoldList>멘토에게 도움을
            받을 때 가장 좋은 점은 여러분께서 즉시 실천하고 실행할 수 있는
            실질적인 조언이라는 것입니다.
          </li>
          <br />
          <li>
            <BoldList>멘토의 경험으로부터 배울 수 있습니다</BoldList>멘토들은
            보통 여러분과 같은 근무환경에서의 경험을 가지고 있습니다. 이는
            멘토의 개인적인 경험을 통해서 무엇을 하고, 무엇을 하지 말아야 할지
            배울 수 있습니다.
          </li>
          <br />
          <li>
            <BoldList>여러분의 타고난 장점과 재능을 격려 받게 됩니다</BoldList>
            여러분의 멘토는 여러분의 장점을 빠르게 파악해야 하고, 여러분이
            최선을 다해 장점을 발전시킬 수 있도록 격려 받을 것입니다.
          </li>
          <br />
          <li>
            <BoldList>건설적이고 생산적인 피드백을 받게 됩니다</BoldList>멘토는
            편견이 없습니다. 이는, 여러분과 여러분의 사업을 객관적으로 바라볼 수
            있으며, 생산적인 피드백을 제공드릴 수 있음을 의미합니다.
          </li><br/>
          <li>
            <BoldList>의견을 공유할 수 있는 사람이 생깁니다</BoldList>때때로
            멘토가 있는 것이 가장 도움될 때는 여러분의 생각에 대한 자문을 구할
            수 있다는 것입니다.
          </li>
          <li>
            <BoldList>여러분의 네트워크를 확장시킬 수 있는 가능성이 생기게 됩니다</BoldList>많은 멘토들이 본인들이 아는 사람들을 소개해주거나 네트워킹 할 수 있는 기회에 기꺼이 초대할 것입니다.

          </li>
          <li>
            <BoldList>인적네트워크를 형성하고 여러분 스스로를 홍보할 수 있도록 격려 받게 됩니다</BoldList>당신의 멘토는 자신의 지인들을 여러분에게 소개해줄 뿐만 아니라, 여러분 자신의 네트워킹 이벤트를 주최하고 여러분 자신을 홍보하는 방법을 생각하도록 격려해 드릴 것입니다.

          </li>
          <li>
            <BoldList>생산성을 향상시킬 수 있는 기회를 갖게 됩니다</BoldList>때멘토들은 여러분이 시간을 효율적으로 관리하게끔 도움을 드리며, 이를 통해 여러분이 일과 삶의 균형을 잘 이룰 수 있게 합니다.

          </li>
          <li>
            <BoldList>감정을 털어놓을 수 있는 사람이 생깁니다</BoldList>때때로 당신의 멘토는 비즈니스 주체자로서 여러분이 겪고 있는 어려움을 이해하는 유일한 사람입니다. 좌절의 시기에 이러한 관계는 위로가 됩니다.

          </li>
          <li>
            <BoldList>개인적으로나 직업적으로 여러분의 잠재력을 실현할 수 있습니다</BoldList>멘토링의 목표는 궁극적으로 여러분의 잠재력을 깨닫게 하는 것이고, 이것을 깨달았을 때 여러분의 삶의 다른 분야에서도 여러분의 자신감을 북돋울 수 있게 합니다.

          </li>
        </ol>
      </Subtitle>
      <Subheading>멘토로부터 얻을 수 있는 것들</Subheading>
      <Subtitle>
        <ul>
          <li> 본인 스스로와 본인의 사업에 대해 편견 없는 제3자의 관점 제공</li>
          <li> 멘토의 경험을 공유함으로써 도움을 줌</li>
          <li> 사업 고민들에 대한 기밀유지 및 경청</li>
          <li> 지속적인 지원과 격려 제공</li>
          <li> 정직하고 건설적인 피드백 제공</li>
          <li> 전문성 개발을 돕기 위한 연락처 공유</li>
          <li> 의사결정에 도움을 드리며 적합하다고 판단되는 대안책 제시</li>
      
        </ul>
      </Subtitle>
      <Subheading>멘토에게 제공 받길 기대하면 안되는 것</Subheading>
      <Subtitle>
        <ul>
          <li> 기술적인 비즈니스 충고 제공</li>
          <li> 트레이닝 서비스 제공</li>
          <li> 의사 결정 및 사업 성공에 대한 책임감 부여</li>
          <li> 카운셀링 서비스 제공</li>
          <li> 24시간 항시대기</li>
        
        </ul>
      </Subtitle>
      <Subtitle>물론 모든 멘토는 일하는 방식이 각기 다르며, 이 목록에 한정 되지 않습니다. 정기적인 미팅을 갖기 전에 멘토에 대해서 가능한 한 많은 것들을 알아보기를 항상 권장 드리고 있습니다.
</Subtitle>
      <Subtitle>많은 멘토들은 여러분이 약속을 잡기 전에 상담을 제공 드리고 있습니다. 첫 번째 미팅은 멘토와 함께 본인의 목표에 대해 논의하고, 더 알아가는 시간을 가지며 이러한 목표들이 본인에게 적합한지 아닌지 확인하는 시간이 될 것입니다.</Subtitle>
    </>
  );
};

export default TextFormat;
